{
  "account": "realDonaldTrump",
  "scrapingDate": "2025-05-27T16:42:47.935Z",
  "targetPostCount": 30,
  "totalPosts": 30,
  "posts": [
    {
      "timestamp": "2025-05-26T19:50:36.000Z",
      "tweetText": "Oil prices are down, interest rates are down (the slow moving Fed should cut rates!), food prices are down, there is NO INFLATION, and the long time abused USA is bringing in Billions of Dollars a week from the abusing countries on Tariffs that are already in place. This is despite the fact that the biggest abuser of them all, China, whose markets are crashing, just raised its Tariffs by 34%, on top of its long term ridiculously high Tariffs (Plus!), not acknowledging my warning for abusing countries not to retaliate. They’ve made enough, for decades, taking advantage of the Good OL’ USA! Our past “leaders” are to blame for allowing this, and so much else, to happen to our Country. MAKE AMERICA GREAT AGAIN!",
      "isRepost": false,
      "originalAuthor": "realDonaldTrump",
      "postUrl": "/realDonaldTrump/status/1927090010353721796"
    },
    {
      "timestamp": "2025-05-24T14:18:32.000Z",
      "tweetText": "These Houthis gathered for instructions on an attack. Oops, there will be no attack by these Houthis! They will never sink our ships again!",
      "isRepost": false,
      "originalAuthor": "realDonaldTrump",
      "postUrl": "/realDonaldTrump/status/1926281665929691590"
    },
    {
      "timestamp": "2025-05-22T13:44:04.000Z",
      "tweetText": "“THE ONE, BIG, BEAUTIFUL BILL” has PASSED the House of Representatives! This is arguably the most significant piece of Legislation that will ever be signed in the History of our Country! The Bill includes MASSIVE Tax CUTS, No Tax on Tips, No Tax on Overtime, Tax Deductions when",
      "isRepost": false,
      "originalAuthor": "realDonaldTrump",
      "postUrl": "/realDonaldTrump/status/1925548216243703820"
    },
    {
      "timestamp": "2025-05-21T14:47:03.000Z",
      "tweetText": "REPUBLICANS MUST DEFUND AND TOTALLY DISASSOCIATE THEMSELVES FROM NPR & PBS, THE RADICAL LEFT “MONSTERS” THAT SO BADLY HURT OUR COUNTRY!",
      "isRepost": false,
      "originalAuthor": "realDonaldTrump",
      "postUrl": "/realDonaldTrump/status/1925201677914603580"
    },
    {
      "timestamp": "2025-05-19T17:50:57.000Z",
      "tweetText": "Just completed my two hour call with President Vladimir Putin of Russia. I believe it went very well. Russia and Ukraine will immediately start negotiations toward a Ceasefire and, more importantly, an END to the War. The conditions for that will be negotiated between the two parties, as it can only be, because they know details of a negotiation that nobody else would be aware of. The tone and spirit of the conversation were excellent. If it wasn't, I would say so now, rather than later. Russia wants to do largescale TRADE with the United States when this catastrophic bloodbath is over, and I agree. There is a tremendous opportunity for Russia to create massive amounts of jobs and wealth. Its potential is UNLIMITED. Likewise, Ukraine can be a great beneficiary on Trade, in the process of rebuilding its Country. Negotiations between Russia and Ukraine will begin immediately. I have so informed President Volodymyr Zelenskyy, of Ukraine, Ursula von der Leyen, President of the European Commission, President Emmanuel Macron, of France, Prime Minister Giorgia Meloni, of Italy, Chancellor Friedrich Merz, of Germany, and President Alexander Stubb, of Finland, during a call with me, immediately after the call with President Putin. The Vatican, as represented by the Pope, has stated that it would be very interested in hosting the negotiations. Let the process begin!",
      "isRepost": false,
      "originalAuthor": "realDonaldTrump",
      "postUrl": "/realDonaldTrump/status/1924523182909747657"
    },
    {
      "timestamp": "2025-05-17T17:31:12.000Z",
      "tweetText": "🇦🇪🇺🇸",
      "isRepost": false,
      "originalAuthor": "realDonaldTrump",
      "postUrl": "/realDonaldTrump/status/1923793436068487574"
    },
    {
      "timestamp": "2025-05-17T17:29:44.000Z",
      "tweetText": "🇶🇦🇺🇸",
      "isRepost": false,
      "originalAuthor": "realDonaldTrump",
      "postUrl": "/realDonaldTrump/status/1923793069138178293"
    },
    {
      "timestamp": "2025-05-17T17:27:58.000Z",
      "tweetText": "🇸🇦🇺🇸",
      "isRepost": false,
      "originalAuthor": "realDonaldTrump",
      "postUrl": "/realDonaldTrump/status/1923792625028497464"
    },
    {
      "timestamp": "2025-05-16T17:37:33.000Z",
      "tweetText": "THE SUPREME COURT IS BEING PLAYED BY THE RADICAL LEFT LOSERS, WHO HAVE NO SUPPORT, THE PUBLIC HATES THEM, AND THEIR ONLY HOPE IS THE INTIMIDATION OF THE COURT, ITSELF. WE CAN’T LET THAT HAPPEN TO OUR COUNTRY!",
      "isRepost": false,
      "originalAuthor": "realDonaldTrump",
      "postUrl": "/realDonaldTrump/status/1923432648103333919"
    },
    {
      "timestamp": "2025-05-16T17:16:46.000Z",
      "tweetText": "Republicans MUST UNITE behind, “THE ONE, BIG BEAUTIFUL BILL!” Not only does it cut Taxes for ALL Americans, but it will kick millions of Illegal Aliens off of Medicaid to PROTECT it for those who are the ones in real need. The Country will suffer greatly without this Legislation,",
      "isRepost": false,
      "originalAuthor": "realDonaldTrump",
      "postUrl": "/realDonaldTrump/status/1923427418913616200"
    },
    {
      "timestamp": "2025-05-13T17:47:15.000Z",
      "tweetText": "There will never have been a transformation of a Country like the transformation that is happening, for all to see, in the United States of America. Companies are pouring into our Country at levels never seen before, with Jobs (and Money!) to follow. It is a beautiful thing to watch!",
      "isRepost": false,
      "originalAuthor": "realDonaldTrump",
      "postUrl": "/realDonaldTrump/status/1922347924987474196"
    },
    {
      "timestamp": "2025-05-12T12:54:40.000Z",
      "tweetText": "DRUG PRICES TO BE CUT BY 59%, PLUS! Gasoline, Energy, Groceries, and all other costs,DOWN. NO INFLATION !!! LOVE, DJT",
      "isRepost": false,
      "originalAuthor": "realDonaldTrump",
      "postUrl": "/realDonaldTrump/status/1921911904429088892"
    },
    {
      "timestamp": "2025-05-12T12:54:25.000Z",
      "tweetText": "So the fact that the Defense Department is getting a GIFT, FREE OF CHARGE, of a 747 aircraft to replace the 40 year old Air Force One, temporarily, in a very public and transparent transaction, so bothers the Crooked Democrats that they insist we pay, TOP DOLLAR, for the plane. Anybody can do that! The Dems are World Class Losers !!! MAGA",
      "isRepost": false,
      "originalAuthor": "realDonaldTrump",
      "postUrl": "/realDonaldTrump/status/1921911844026954234"
    },
    {
      "timestamp": "2025-05-11T22:52:27.000Z",
      "tweetText": "I am happy to announce that Edan Alexander, an American citizen who has been held hostage since October 2023, is coming home to his family. I am grateful to all those involved in making this monumental news happen. This was a step taken in good faith towards the United States and the efforts of the mediators - Qatar and Egypt - to put an end to this very brutal war and return ALL living hostages and remains to their loved ones. Hopefully this is the first of those final steps necessary to end this brutal conflict. I look very much forward to that day of celebration!",
      "isRepost": false,
      "originalAuthor": "realDonaldTrump",
      "postUrl": "/realDonaldTrump/status/1921699954696855934"
    },
    {
      "timestamp": "2025-05-10T12:03:09.000Z",
      "tweetText": "After a long night of talks mediated by the United States, I am pleased to announce that India and Pakistan have agreed to a FULL AND IMMEDIATE CEASEFIRE. Congratulations to both Countries on using Common Sense and Great Intelligence. Thank you for your attention to this matter!",
      "isRepost": false,
      "originalAuthor": "realDonaldTrump",
      "postUrl": "/realDonaldTrump/status/1921174163848401313"
    },
    {
      "timestamp": "2025-05-10T01:04:06.000Z",
      "tweetText": "Today, I signed an Executive Order to launch the first-ever self-deportation program. Illegal aliens who stay in America face punishments, including—sudden deportation, in a place and manner solely of our discretion. TO ALL ILLEGAL ALIENS: BOOK YOUR FREE FLIGHT RIGHT NOW!",
      "isRepost": false,
      "originalAuthor": "realDonaldTrump",
      "postUrl": "/realDonaldTrump/status/1921008311492624867"
    },
    {
      "timestamp": "2025-05-09T02:40:11.000Z",
      "tweetText": "🇺🇸🇬🇧",
      "isRepost": false,
      "originalAuthor": "realDonaldTrump",
      "postUrl": "/realDonaldTrump/status/1920670100987740317"
    },
    {
      "timestamp": "2025-05-08T16:40:16.000Z",
      "tweetText": "America First Patriot Randy Fine is running to represent the Wonderful People of Florida’s 6th Congressional District! A highly successful, Harvard educated businessman, and greatly respected State Legislator, Randy has been a tremendous Voice for MAGA. In Congress, Randy will be an incredible fighter, who will work tirelessly with me to Strengthen our Economy, Lower Taxes, Secure the Border, Champion our Military/Vets, Ensure American Energy DOMINANCE, Protect our always under siege Second Amendment, and Advance PEACE THROUGH STRENGTH. Randy Fine has my Complete and Total Endorsement! Election Day is this Tuesday, April 1st. GET OUT AND VOTE FOR RANDY — HE WILL NOT LET YOU DOWN! https://swampthevoteusa.com/fl-06/",
      "isRepost": false,
      "originalAuthor": "realDonaldTrump",
      "postUrl": "/realDonaldTrump/status/1920519130941170088"
    },
    {
      "timestamp": "2025-05-06T18:27:37.000Z",
      "tweetText": "Democratic Rep. Jasmine Crockett accused of ‘abusing her power’ at airport after she cut passengers in wheelchairs https://trib.al/Dscc1R8",
      "isRepost": true,
      "originalAuthor": "nypost",
      "postUrl": "/nypost/status/1919821368733888617"
    },
    {
      "timestamp": "2025-05-07T02:38:22.000Z",
      "tweetText": "",
      "isRepost": false,
      "originalAuthor": "realDonaldTrump",
      "postUrl": "/realDonaldTrump/status/1919944872020127980"
    },
    {
      "timestamp": "2025-05-05T17:41:13.000Z",
      "tweetText": "In two months, there has been more Private Investment spoken for, and/or committed to, than in four years of the Sleepy Joe Biden Administration — A fact that the Fake News hates talking about!",
      "isRepost": false,
      "originalAuthor": "realDonaldTrump",
      "postUrl": "/realDonaldTrump/status/1919447302982299811"
    },
    {
      "timestamp": "2025-05-05T15:54:40.000Z",
      "tweetText": "This was so wonderful, 9 years ago today!",
      "isRepost": false,
      "originalAuthor": "realDonaldTrump",
      "postUrl": "/realDonaldTrump/status/1919420490663288913"
    },
    {
      "timestamp": "2025-05-05T14:28:01.000Z",
      "tweetText": "",
      "isRepost": false,
      "originalAuthor": "realDonaldTrump",
      "postUrl": "/realDonaldTrump/status/1919398681423299068"
    },
    {
      "timestamp": "2025-05-05T14:23:22.000Z",
      "tweetText": "Thank you President Bukele, of El Salvador, for taking the criminals that were so stupidly allowed, by the Crooked Joe Biden Administration, to enter our Country, and giving them such a wonderful place to live!",
      "isRepost": false,
      "originalAuthor": "realDonaldTrump",
      "postUrl": "/realDonaldTrump/status/1919397513032790522"
    },
    {
      "timestamp": "2025-05-05T14:21:01.000Z",
      "tweetText": "The Democrats are really out of control. They have lost everything, especially their minds! These Radical Left Lunatics are into the “Impeachment thing” again. They have already got two “No Name,” little respected Congressmen, total Whackjobs both, throwing the “Impeachment” of",
      "isRepost": false,
      "originalAuthor": "realDonaldTrump",
      "postUrl": "/realDonaldTrump/status/1919396921593958754"
    },
    {
      "timestamp": "2025-05-05T14:17:15.000Z",
      "tweetText": "REBUILD, AND OPEN ALCATRAZ! For too long, America has been plagued by vicious, violent, and repeat Criminal Offenders, the dregs of society, who will never contribute anything other than Misery and Suffering. When we were a more serious Nation, in times past, we did not hesitate",
      "isRepost": false,
      "originalAuthor": "realDonaldTrump",
      "postUrl": "/realDonaldTrump/status/1919395973802897676"
    },
    {
      "timestamp": "2025-05-05T14:16:22.000Z",
      "tweetText": "The United States has a chance to do something that should have been done DECADES AGO. Don’t be Weak! Don’t be Stupid! Don’t be a PANICAN (A new party based on Weak and Stupid people!). Be Strong, Courageous, and Patient, and GREATNESS will be the result!",
      "isRepost": false,
      "originalAuthor": "realDonaldTrump",
      "postUrl": "/realDonaldTrump/status/1919395751030923738"
    },
    {
      "timestamp": "2025-05-02T02:07:46.000Z",
      "tweetText": "Following my Day One Executive Order, the Office of Personnel Management will be issuing new Civil Service Regulations for career government employees. Moving forward, career government employees, working on policy matters, will be classified as “Schedule Policy/Career,” and will be held to the highest standards of conduct and performance. If these government workers refuse to advance the policy interests of the President, or are engaging in corrupt behavior, they should no longer have a job. This is common sense, and will allow the federal government to finally be “run like a business.” We must root out corruption and implement accountability in our Federal Workforce!",
      "isRepost": false,
      "originalAuthor": "realDonaldTrump",
      "postUrl": "/realDonaldTrump/status/1918125229420732456"
    },
    {
      "timestamp": "2025-05-02T02:07:30.000Z",
      "tweetText": "This is the hand of the man that the Democrats feel should be brought back to the United States, because he is such “a fine and innocent person.” They said he is not a member of MS-13, even though he’s got MS-13 tattooed onto his knuckles, and two Highly Respected Courts found that he was a member of MS-13, beat up his wife, etc. I was elected to take bad people out of the United States, among other things. I must be allowed to do my job. MAKE AMERICA GREAT AGAIN!",
      "isRepost": false,
      "originalAuthor": "realDonaldTrump",
      "postUrl": "/realDonaldTrump/status/1918125161058058627"
    },
    {
      "timestamp": "2025-04-28T14:28:08.000Z",
      "tweetText": "Join me tomorrow, April 29th—in Warren, Michigan at 6:00PM Eastern!",
      "isRepost": false,
      "originalAuthor": "realDonaldTrump",
      "postUrl": "/realDonaldTrump/status/1916861996021989540"
    }
  ]
}
