{
  "username": "kamalaharris",
  "totalPosts": 30,
  "posts": [
    {
      "url": "https://www.instagram.com/kamalaharris/p/DKHv3Kqu9_0/",
      "username": "",
      "postText": "On Memorial Day, we honor the brave service members who have made the ultimate sacrifice on behalf of our nation.We owe these heroes and their loved ones everything, and we will always remember what they have done to protect our freedom.",
      "likes": 236044,
      "timestamp": "2025-05-26T15:01:33.000Z",
      "extractedAt": "2025-05-27T19:03:57.232Z"
    },
    {
      "url": "https://www.instagram.com/kamalaharris/p/DJz3wS4zsFb/",
      "username": "",
      "postText": "Doug and I are saddened to learn of President Biden’s prostate cancer diagnosis. We are keeping him, Dr. Biden, and their entire family in our hearts and prayers during this time. Joe is a fighter — and I know he will face this challenge with the same strength, resilience, and optimism that have always defined his life and leadership. We are hopeful for a full and speedy recovery.",
      "likes": 979324,
      "timestamp": "2025-05-18T21:45:42.000Z",
      "extractedAt": "2025-05-27T19:04:07.646Z"
    },
    {
      "url": "https://www.instagram.com/kamalaharris/p/DJhWKd_OAAf/",
      "username": "",
      "postText": "Today I am thinking of my mother, Dr. Shyamala Gopalan Harris, and the many lessons she taught me. I am so proud to be her daughter.Happy Mother's Day to the mothers, stepmoms, grandmothers, godmothers, aunties, and all the women in our lives who love, raise, and guide us.",
      "likes": 722899,
      "timestamp": "2025-05-11T17:05:51.000Z",
      "extractedAt": "2025-05-27T19:04:18.787Z"
    },
    {
      "url": "https://www.instagram.com/emergeamerica/p/DJGbwLQOcye/?img_index=1",
      "username": "emergeamerica",
      "postText": "THE Original Emerge Woman. Vice President @kamalaharris spoke about the erosion of our democracy and our rights during the first 100 days of the Trump administration. It was a powerful reminder of the importance of meeting the moment and bridging engagement with meaningful action. We are ready for this fight.Thank you, Vice President Harris.#Emerge20",
      "likes": 171246,
      "timestamp": "2025-05-01T06:15:12.000Z",
      "extractedAt": "2025-05-27T19:04:30.942Z"
    },
    {
      "url": "https://www.instagram.com/kamalaharris/p/DIrbghJT9xb/?img_index=1",
      "username": "",
      "postText": "On Easter Sunday, we celebrate joy, hope, and our faith in renewal — even through the darkest of times. To all those celebrating today, our family wishes you a happy Easter.",
      "likes": 2369016,
      "timestamp": "2025-04-20T18:33:34.000Z",
      "extractedAt": "2025-05-27T19:04:41.159Z"
    },
    {
      "url": "https://www.instagram.com/kamalaharris/reel/DIg5jy6IX97/",
      "username": "",
      "postText": "During Black Maternal Health Week, we celebrate the progress we have made and continue to address this issue with urgency.This year, as Black maternal health initiatives and women’s health research are under attack, our fight remains more important than ever. Together, we continue the fight to ensure every woman has access to the health care she needs.",
      "likes": 209044,
      "timestamp": "2025-04-16T16:26:06.000Z",
      "extractedAt": "2025-05-27T19:04:52.866Z"
    },
    {
      "url": "https://www.instagram.com/kamalaharris/reel/DIJ4uMHvD4e/",
      "username": "",
      "postText": "Fear has a way of being contagious.But courage is also contagious.",
      "likes": 228189,
      "timestamp": "2025-04-07T17:55:36.000Z",
      "extractedAt": "2025-05-27T19:05:03.408Z"
    },
    {
      "url": "https://www.instagram.com/kamalaharris/p/DH7jUJkuN5X/?img_index=1",
      "username": "",
      "postText": "Judge Susan Crawford's victory is a victory for working people in Wisconsin. She will take her seat on the bench and continue to uphold the rights and protect the freedoms of all people in her state.Last night, I joined the @wisdems team to thank them for their hard work in this election. Together, with leaders all across our nation, we will continue to push for progress.",
      "likes": 549990,
      "timestamp": "2025-04-02T04:18:14.000Z",
      "extractedAt": "2025-05-27T19:05:13.945Z"
    },
    {
      "url": "https://www.instagram.com/kamalaharris/p/DH7J1zSyqxB/",
      "username": "",
      "postText": "The true measure of a leader is not based on who you beat down but on who you lift up.For over 24 hours, my friend @corybooker stood on the floor of the Senate and lifted up the voices of the American people harmed by the current administration.We must continue to fight for the best of who we are as Americans. Thank you, Cory, for your leadership.",
      "likes": 1291617,
      "timestamp": "2025-04-02T00:35:38.000Z",
      "extractedAt": "2025-05-27T19:05:24.981Z"
    },
    {
      "url": "https://www.instagram.com/kamalaharris/p/DG9eO1kP1c0/?img_index=1",
      "username": "",
      "postText": "On International Women’s Day, we celebrate sisters, friends, aunties, coworkers, and all the women who bring joy to our lives.Let us remember and live the words of my mother, Dr. Shyamala Gopalan Harris: While we may be the first to do many things, we must make sure we are not the last. When we lift up women, we lift up children, families, communities, and all of society.",
      "likes": 754155,
      "timestamp": "2025-03-09T01:40:54.000Z",
      "extractedAt": "2025-05-27T19:05:37.866Z"
    },
    {
      "url": "https://www.instagram.com/kamalaharris/p/DG6M1EXSs4b/?img_index=1",
      "username": "",
      "postText": "Today, we mark the 60th anniversary of Bloody Sunday.On that cold Sunday morning, 600 brave souls began their march from Selma to Montgomery. They were met with crushing violence, beaten by troopers with nightsticks and trampled by horses. And still, they returned to Selma and marched on, crossing the Edmund Pettus Bridge determined to push our nation toward a future that was more equal, more just, and more free.60 years later, we honor the legacy of those 600 brave souls, and we march on.This work is not easy, and we cannot do it alone. Together, we recommit to our fight to safeguard the freedom to vote. Together, we must stand for democracy. Together, we must continue our fight for justice, equality, and opportunity for all.",
      "likes": 942492,
      "timestamp": "2025-03-07T19:11:07.000Z",
      "extractedAt": "2025-05-27T19:05:48.541Z"
    },
    {
      "url": "https://www.instagram.com/kamalaharris/p/DGaCuwAxxEy/?img_index=1",
      "username": "",
      "postText": "This evening, I was honored to accept the NAACP’s Chairman’s Award. I grew up inspired by the work of the NAACP — by all those who took up the fight for justice, equality, and opportunity. Their example is part of the reason I chose a life of public service.At this moment, people around our nation see the flames on our horizons, the rising waters in our cities, the shadows gathering over our democracy, and ask, “What do we do now?”We know exactly what to do. Like those who forged the NAACP and those who carried its legacy forward, we use our power. We organize, mobilize, educate, and advocate.Not because it’s easy, but because it’s necessary. Because the fight is worth it.This chapter in our American story will be written not by whoever occupies the Oval Office, nor by the wealthiest among us.The American story will be written by we, the people.",
      "likes": 614366,
      "timestamp": "2025-02-23T07:27:10.000Z",
      "extractedAt": "2025-05-27T19:05:58.043Z"
    },
    {
      "url": "https://www.instagram.com/bet/reel/DGZguIHtwcB/",
      "username": "bet",
      "postText": "The most impactful 107 days we've ever seen. Vice President Kamala Harris galvanized millions of people from across the country and centered the issues of everyday people. A pillar of sacrifice and service, Kamala has dedicated over three decades of her life to the betterment of her constituents, from California to all 50 states. Thank you, Kamala, for showing us what grace, poise, and authority look like in the face of seemingly insurmountable odds. Thank you for showing us what's possible. Congratulations to Vice President Kamala Harris on receiving the  Chairman Award at the 2025 #NAACPImageAwards",
      "likes": 521538,
      "timestamp": "2025-02-23T19:50:17.000Z",
      "extractedAt": "2025-05-27T19:06:10.538Z"
    },
    {
      "url": "https://www.instagram.com/kamalaharris/p/DGEaEEgvpAb/",
      "username": "",
      "postText": "Happy Valentine’s Day to the best partner and husband. I love you, Dougie.",
      "likes": 672923,
      "timestamp": "2025-02-14T21:47:46.000Z",
      "extractedAt": "2025-05-27T19:06:20.381Z"
    },
    {
      "url": "https://www.instagram.com/kamalaharris/p/DFwJ0B9PIEj/?img_index=1",
      "username": "",
      "postText": "In January, we saw historic damage in Altadena, Pacific Palisades, and throughout Los Angeles due to wildfires. These blazes — made worse by the climate crisis — devastated communities.At the same time, we also witnessed the best of who we are as Americans, including neighbors supporting one another and the heroic actions of our first responders. Today, I had the pleasure of meeting some of them.Angelenos are clear: We will continue to stand together as we recover and rebuild.",
      "likes": 421221,
      "timestamp": "2025-02-07T01:00:57.000Z",
      "extractedAt": "2025-05-27T19:06:29.273Z"
    },
    {
      "url": "https://www.instagram.com/douglasemhoff/p/DFemwN4RIUc/",
      "username": "douglasemhoff",
      "postText": "Kamala and I are grateful to be at the FireAid concert tonight in our hometown of Los Angeles. It is a wonderful night that shows the strength and resilience of our city as we begin to recover and rebuild from the devastating wildfires.",
      "likes": 1046255,
      "timestamp": "2025-01-31T05:27:31.000Z",
      "extractedAt": "2025-05-27T19:06:41.381Z"
    },
    {
      "url": "https://www.instagram.com/wckitchen/p/DFE23uJOKVM/?img_index=1",
      "username": "wckitchen",
      "postText": "Former Vice President @kamalaharris returned to her home state on Monday and joined our wildfire relief efforts, serving food at two WCK sites in Altadena. Californians have been the driving force behind our response, with neighbors supporting neighbors since the Los Angeles fires began. The former Vice President is one of hundreds of local volunteers who have helped deliver more than 200,000 meals to first responders and families in need. #ChefsForCalifornia",
      "likes": 401070,
      "timestamp": "2025-01-21T05:28:08.000Z",
      "extractedAt": "2025-05-27T19:06:50.745Z"
    },
    {
      "url": "https://www.instagram.com/kamalaharris/p/DFEQcXiPW5C/",
      "username": "",
      "postText": "It has been the honor of my lifetime to serve as your Vice President. Stay connected with me at KamalaHarris.com.",
      "likes": 1666623,
      "timestamp": "2025-01-20T23:52:19.000Z",
      "extractedAt": "2025-05-27T19:06:59.468Z"
    },
    {
      "url": "https://www.instagram.com/kamalaharris/p/DCFN5JKvhBc/",
      "username": "",
      "postText": "For the people. Always.",
      "likes": 2370785,
      "timestamp": "2024-11-07T19:15:08.000Z",
      "extractedAt": "2025-05-27T19:07:09.144Z"
    },
    {
      "url": "https://www.instagram.com/kamalaharris/p/DCDDfiDO-sc/?img_index=1",
      "username": "",
      "postText": "My heart is full today—full of gratitude for the trust you have placed in me, full of love for our country, and full of resolve. The outcome of this election is not what we wanted or what we fought for, but hear me when I say: The light of America's promise will always burn bright—as long as we never give up, and as long as we keep fighting. There is an adage: Only when it is dark enough can you see the stars. I know many people feel like we are entering a dark time. For the benefit of us all, I hope that is not the case. But, America, if it is: Let us fill the sky with the light of a billion brilliant stars.May the light of optimism, faith, truth, and service guide us—even in the face of setbacks—toward the extraordinary promise of the United States of America.",
      "likes": 4153375,
      "timestamp": "2024-11-06T23:05:45.000Z",
      "extractedAt": "2025-05-27T19:07:18.065Z"
    },
    {
      "url": "https://www.instagram.com/kamalaharris/p/DCAjMuQuuFA/",
      "username": "kamalaharris",
      "postText": "If you are in line before the polls close, stay in line. It is your right to make your voice heard. If you have any trouble casting your ballot, call our Voter Assistance Hotline: 833-336-8683.",
      "likes": 440994,
      "timestamp": "2024-11-05T23:45:06.000Z",
      "extractedAt": "2025-05-27T19:07:28.434Z"
    },
    {
      "url": "https://www.instagram.com/kamalaharris/reel/DCAhn0av8hA/",
      "username": "",
      "postText": "If you’re in line when the polls close, stay in line, because you have a right to make your voice heard: IWillVote.com",
      "likes": 853664,
      "timestamp": "2024-11-05T23:32:31.000Z",
      "extractedAt": "2025-05-27T19:07:38.110Z"
    },
    {
      "url": "https://www.instagram.com/kamalaharris/reel/DCAe_9wMYYH/",
      "username": "",
      "postText": "I love Gen Z, and I am grateful to our first-time voters for making their voices heard. IWillVote.com",
      "likes": 598581,
      "timestamp": "2024-11-05T23:09:04.000Z",
      "extractedAt": "2025-05-27T19:07:47.462Z"
    },
    {
      "url": "https://www.instagram.com/kamalaharris/reel/DCAdCXtMMV0/",
      "username": "",
      "postText": "Hopped on the phone to speak with voters (and one future voter) today. Thanks for picking up my call, Jennifer and Sage!Help us get every last voter to the polls.",
      "likes": 410337,
      "timestamp": "2024-11-05T22:52:04.000Z",
      "extractedAt": "2025-05-27T19:07:58.396Z"
    },
    {
      "url": "https://www.instagram.com/kamalaharris/reel/DCATcBLOBqV/",
      "username": "",
      "postText": "Let’s chart a new way forward, together: IWillVote.com",
      "likes": 433940,
      "timestamp": "2024-11-05T21:28:03.000Z",
      "extractedAt": "2025-05-27T19:08:08.303Z"
    },
    {
      "url": "https://www.instagram.com/kamalaharris/reel/DCAM_6YBor8/",
      "username": "",
      "postText": "To everyone who has worked hard and brought back the joy during this campaign—thank you.",
      "likes": 261399,
      "timestamp": "2024-11-05T20:31:31.000Z",
      "extractedAt": "2025-05-27T19:08:16.659Z"
    },
    {
      "url": "https://www.instagram.com/kamalaharris/p/DCAJgrTPRd9/?img_index=1",
      "username": "",
      "postText": "Now is your chance. Get out there and vote.",
      "likes": 234682,
      "timestamp": "2024-11-05T20:00:38.000Z",
      "extractedAt": "2025-05-27T19:08:27.128Z"
    },
    {
      "url": "https://www.instagram.com/kamalaharris/reel/DCAHhchphyv/",
      "username": "kamalaharris",
      "postText": "Love you, Dougie.",
      "likes": 479304,
      "timestamp": "2024-11-05T19:43:34.000Z",
      "extractedAt": "2025-05-27T19:08:38.017Z"
    },
    {
      "url": "https://www.instagram.com/kamalaharris/reel/DCACpXkCBsh/",
      "username": "",
      "postText": "When we vote, we win. IWillVote.com",
      "likes": 171185,
      "timestamp": "2024-11-05T19:01:23.000Z",
      "extractedAt": "2025-05-27T19:08:48.092Z"
    },
    {
      "url": "https://www.instagram.com/kamalaharris/p/DB_3JxfNWO6/?img_index=1",
      "username": "",
      "postText": "We are finishing this campaign as we started: with optimism, with energy, and with joy.",
      "likes": 1322510,
      "timestamp": "2024-11-05T17:20:12.000Z",
      "extractedAt": "2025-05-27T19:08:57.791Z"
    }
  ],
  "scrapedAt": "2025-05-27T19:08:59.801Z"
}