{
  "username": "narendramodi",
  "totalPosts": 30,
  "posts": [
    {
      "url": "https://www.instagram.com/narendramodi/p/DKH7B1uBM4U/?img_index=1",
      "username": "",
      "postText": "A very special day in Gujarat! Attended programmes in Vadodara, Dahod, Bhuj and Ahmedabad. Here are glimpses…",
      "likes": 2269128,
      "timestamp": "2025-05-26T16:39:07.000Z",
      "extractedAt": "2025-05-27T18:41:07.619Z"
    },
    {
      "url": "https://www.instagram.com/narendramodi/reel/DJ9Rk5nBiPZ/",
      "username": "",
      "postText": "जो सिंदूर मिटाने निकले थे...उन्हें मिट्टी में मिलाया है।जो हिंदुस्तान का लहू बहाते थे...आज कतरे-कतरे का हिसाब चुकाया है!",
      "likes": 733938,
      "timestamp": "2025-05-22T13:25:22.000Z",
      "extractedAt": "2025-05-27T18:41:17.268Z"
    },
    {
      "url": "https://www.instagram.com/narendramodi/reel/DJmOiewhwBa/",
      "username": "",
      "postText": "At the Adampur Air Base, met our brave army personnel. India is proud of their unwavering courage, resolve and strength.",
      "likes": 2944861,
      "timestamp": "2025-05-13T14:35:00.000Z",
      "extractedAt": "2025-05-27T18:41:25.915Z"
    },
    {
      "url": "https://www.instagram.com/narendramodi/p/DJlikyehKHz/?img_index=1",
      "username": "",
      "postText": "Sharing some more glimpses from my visit to AFS Adampur.",
      "likes": 3259056,
      "timestamp": "2025-05-13T08:11:16.000Z",
      "extractedAt": "2025-05-27T18:41:35.115Z"
    },
    {
      "url": "https://www.instagram.com/narendramodi/p/DJlbHN_hUeD/?img_index=1",
      "username": "",
      "postText": "Earlier this morning, I went to AFS Adampur and met our brave air warriors and soldiers. It was a very special experience to be with those who epitomise courage, determination and fearlessness. India is eternally grateful to our armed forces for everything they do for our nation.",
      "likes": 2928150,
      "timestamp": "2025-05-13T07:06:03.000Z",
      "extractedAt": "2025-05-27T18:41:44.445Z"
    },
    {
      "url": "https://www.instagram.com/narendramodi/reel/DJj4-76BUGe/",
      "username": "",
      "postText": "#OperationSindoor has shown India’s strong resolve to eliminate terrorism!",
      "likes": 1597148,
      "timestamp": "2025-05-12T16:49:29.000Z",
      "extractedAt": "2025-05-27T18:41:53.998Z"
    },
    {
      "url": "https://www.instagram.com/narendramodi/reel/DJJp1KABGA4/",
      "username": "",
      "postText": "The Vizhinjam International Deepwater Multipurpose Seaport in Kerala is a significant advancement in India’s maritime infrastructure!",
      "likes": 2233188,
      "timestamp": "2025-05-02T12:16:57.000Z",
      "extractedAt": "2025-05-27T18:42:06.506Z"
    },
    {
      "url": "https://www.instagram.com/narendramodi/reel/DI0zBLuhkmN/",
      "username": "",
      "postText": "India will identify, track and punish every terrorist, their handlers and their backers. We will pursue them to the ends of the earth.",
      "likes": 10474863,
      "timestamp": "2025-04-24T09:53:09.000Z",
      "extractedAt": "2025-05-27T18:42:16.130Z"
    },
    {
      "url": "https://www.instagram.com/narendramodi/p/DIyz3A5Beh0/",
      "username": "",
      "postText": "In the wake of the terrorist attack in Pahalgam, chaired a meeting of the CCS at 7, Lok Kalyan Marg.",
      "likes": 2222648,
      "timestamp": "2025-04-23T15:21:02.000Z",
      "extractedAt": "2025-05-27T18:42:25.732Z"
    },
    {
      "url": "https://www.instagram.com/narendramodi/p/DIs90eohZSA/",
      "username": "",
      "postText": "Deeply pained by the passing of His Holiness Pope Francis. In this hour of grief and remembrance, my heartfelt condolences to the global Catholic community. Pope Francis will always be remembered as a beacon of compassion, humility and spiritual courage by millions across the world. From a young age, he devoted himself towards realising the ideals of Lord Christ. He diligently served the poor and downtrodden. For those who were suffering, he ignited a spirit of hope. I fondly recall my meetings with him and was greatly inspired by his commitment to inclusive and all-round development. His affection for the people of India will always be cherished. May his soul find eternal peace in God’s embrace.(Sharing a photo from one of our previous meetings)",
      "likes": 1475238,
      "timestamp": "2025-04-21T08:52:37.000Z",
      "extractedAt": "2025-05-27T18:42:36.350Z"
    },
    {
      "url": "https://www.instagram.com/narendramodi/reel/DIbYYQSIZPc/",
      "username": "",
      "postText": "At today’s public meeting in Yamunanagar, I met Shri Rampal Kashyap Ji from Kaithal. He had taken a vow 14 years ago- that he will only wear footwear after I became PM and he got to meet me.I am humbled by people like Rampal Ji and also accept their affection but I want to request everyone who takes up such vows - I cherish your love...please focus on something that is linked to social work and nation building!",
      "likes": 2323450,
      "timestamp": "2025-04-14T12:59:41.000Z",
      "extractedAt": "2025-05-27T18:42:46.616Z"
    },
    {
      "url": "https://www.instagram.com/narendramodi/reel/DIOgqE2ylhS/",
      "username": "",
      "postText": "Navkar Mahamantra carries the essence of inner peace and collective goodwill. Privileged to have attended a special programme today.",
      "likes": 762081,
      "timestamp": "2025-04-09T13:01:45.000Z",
      "extractedAt": "2025-05-27T18:42:55.916Z"
    },
    {
      "url": "https://www.instagram.com/narendramodi/reel/DILv3ENhO_L/",
      "username": "narendramodi",
      "postText": "Dubai has played a key role in advancing the India-UAE Comprehensive Strategic Partnership. This special visit reaffirms our deep-rooted friendship and paves the way for even stronger collaboration in the future.",
      "likes": 1465249,
      "timestamp": "2025-04-08T11:22:49.000Z",
      "extractedAt": "2025-05-27T18:43:06.976Z"
    },
    {
      "url": "https://www.instagram.com/narendramodi/reel/DIIuUcGoY3a/",
      "username": "",
      "postText": "A memorable Ram Navami in Rameswaram! Equally wonderful is inauguration of new infra projects. Here are the highlights..",
      "likes": 1635472,
      "timestamp": "2025-04-07T07:05:52.000Z",
      "extractedAt": "2025-05-27T18:43:17.670Z"
    },
    {
      "url": "https://www.instagram.com/narendramodi/reel/DIHCW8cpDWM/",
      "username": "",
      "postText": "A wonderful conversation with members of the Sri Lankan cricket team that won the 1996 World Cup. Do watch…",
      "likes": 536872,
      "timestamp": "2025-04-06T15:23:38.000Z",
      "extractedAt": "2025-05-27T18:43:27.611Z"
    },
    {
      "url": "https://www.instagram.com/narendramodi/reel/DIGMh5WBxIB/",
      "username": "",
      "postText": "On the way back from Sri Lanka a short while ago, was blessed to have a Darshan of the Ram Setu. And, as a divine coincidence, it happened at the same time as the Surya Tilak was taking place in Ayodhya. Blessed to have the Darshan of both. Prabhu Shri Ram is a uniting force for all of us. May His blessings always remain upon us.",
      "likes": 10673185,
      "timestamp": "2025-04-06T07:32:54.000Z",
      "extractedAt": "2025-05-27T18:43:37.809Z"
    },
    {
      "url": "https://www.instagram.com/narendramodi/reel/DIEmNrjycaH/",
      "username": "",
      "postText": "A productive day in Colombo, which includes talks with President Dissanayake, different meetings and tributes at the IPKF Memorial. Here are the highlights…",
      "likes": 724418,
      "timestamp": "2025-04-05T16:40:16.000Z",
      "extractedAt": "2025-05-27T18:43:49.567Z"
    },
    {
      "url": "https://www.instagram.com/narendramodi/reel/DIDPpnCBUfb/",
      "username": "",
      "postText": "A significant visit to Thailand concludes. I attended the BIMSTEC Summit and took part in programmes that strengthened our cultural ties. Do have a look...",
      "likes": 1502094,
      "timestamp": "2025-04-05T04:00:00.000Z",
      "extractedAt": "2025-05-27T18:43:59.606Z"
    },
    {
      "url": "https://www.instagram.com/narendramodi/reel/DIApSNZSWq8/",
      "username": "",
      "postText": "Gratitude to the people and Government of Thailand for the warm welcome. Here are the highlights from the Day 1 of my Thailand visit.",
      "likes": 743263,
      "timestamp": "2025-04-04T03:58:13.000Z",
      "extractedAt": "2025-05-27T18:44:10.830Z"
    },
    {
      "url": "https://www.instagram.com/narendramodi/reel/DH2o9c4Ivdk/",
      "username": "",
      "postText": "Here are some special moments from my visit to Nagpur. Grateful to the people for their warmth and affection.",
      "likes": 1210752,
      "timestamp": "2025-03-31T06:32:41.000Z",
      "extractedAt": "2025-05-27T18:44:19.745Z"
    },
    {
      "url": "https://www.instagram.com/narendramodi/reel/DHYe9SzS9sH/",
      "username": "",
      "postText": "My message to the youth – See every challenge as an opportunity to grow.",
      "likes": 1691039,
      "timestamp": "2025-03-19T13:40:00.000Z",
      "extractedAt": "2025-05-27T18:44:30.800Z"
    },
    {
      "url": "https://www.instagram.com/narendramodi/p/DHXtl0eI5NT/",
      "username": "",
      "postText": "Welcome back, #Crew9! The Earth missed you. Theirs has been a test of grit, courage and the boundless human spirit. Sunita Williams and the Crew-9 astronauts have once again shown us what perseverance truly means. Their unwavering determination in the face of the vast unknown will forever inspire millions. Space exploration is about pushing the limits of human potential, daring to dream, and having the courage to turn those dreams into reality. Sunita Williams, a trailblazer and an icon, has exemplified this spirit throughout her career.We are incredibly proud of all those who worked tirelessly to ensure their safe return. They have demonstrated what happens when precision meets passion and technology meets tenacity.(Sharing a photo of a previous meeting with Sunita Williams during one of my USA visits)@nasa",
      "likes": 3179457,
      "timestamp": "2025-03-19T06:15:22.000Z",
      "extractedAt": "2025-05-27T18:44:40.632Z"
    },
    {
      "url": "https://www.instagram.com/narendramodi/reel/DHVEeksy07D/",
      "username": "",
      "postText": "India and New Zealand are ready to front up and step up together for a strong and successful partnership! 🇮🇳-🇳🇿",
      "likes": 782980,
      "timestamp": "2025-03-18T05:39:47.000Z",
      "extractedAt": "2025-05-27T18:44:51.088Z"
    },
    {
      "url": "https://www.instagram.com/christopherluxon/p/DHTyzjSSqCA/?img_index=1",
      "username": "christopherluxon",
      "postText": "Together, we visited Gurdwara Rakab Ganj Sahib, a place of profound faith and history. The Sikh community’s unwavering commitment to service and humanity is truly admirable across the world.",
      "likes": 1325736,
      "timestamp": "2025-03-17T17:43:58.000Z",
      "extractedAt": "2025-05-27T18:45:03.641Z"
    },
    {
      "url": "https://www.instagram.com/narendramodi/reel/DHSzU59oR3r/",
      "username": "",
      "postText": "For 24 years, the trust of the people has been my greatest strength. Every day, I commit myself to honouring their trust, ensuring it never falters.",
      "likes": 598604,
      "timestamp": "2025-03-17T08:29:53.000Z",
      "extractedAt": "2025-05-27T18:45:13.099Z"
    },
    {
      "url": "https://www.instagram.com/narendramodi/reel/DHIEw7pBftb/",
      "username": "",
      "postText": "Highlights from the second day of my Mauritius visit…I thank PM Dr. Navinchandra Ramgoolam, the people and Government of Mauritius for the warmth.",
      "likes": 886646,
      "timestamp": "2025-03-13T04:30:00.000Z",
      "extractedAt": "2025-05-27T18:45:24.275Z"
    },
    {
      "url": "https://www.instagram.com/narendramodi/p/DHGbOjISUBD/?img_index=1",
      "username": "",
      "postText": "It was a very emotional feeling to return to Ganga Talao in Mauritius. Standing by its sacred waters, one could feel the deep spiritual connection that transcends borders, binding generations of people to their roots.",
      "likes": 1604433,
      "timestamp": "2025-03-12T13:07:49.000Z",
      "extractedAt": "2025-05-27T18:45:32.840Z"
    },
    {
      "url": "https://www.instagram.com/narendramodi/reel/DHFa5tghZLo/",
      "username": "",
      "postText": "National Day wishes to the people of Mauritius.Here are the highlights from yesterday, which were also very eventful with key meetings and programmes…",
      "likes": 1168812,
      "timestamp": "2025-03-12T03:46:36.000Z",
      "extractedAt": "2025-05-27T18:45:44.238Z"
    },
    {
      "url": "https://www.instagram.com/narendramodi/p/DG7ifMjT5Vv/?img_index=1",
      "username": "",
      "postText": "Namaste India and Happy #WomensDay.I am Dr. @access_anjlee , founder of @samarthyam.cua. Through PM @narendramodi’s social media handle, which I have the honour of taking over today, I want to ignite a spark of transformation, and seek a call to action- forget labels, forget barriers…lets strengthen Sugamya Bharat and make it an important precursor to a Viksit Bharat. Let's ensure that every woman, every individual, can navigate their life with dignity and independence. Let us build on the recent gains and improve lives for persons with disabilities. Here is more about myself- for over three decades, I've worked on universal accessibility and inclusive mobility. These sectors are integral to creating inclusive spaces. Basis my experience of the recent past, I am positive that accessibility and mobility are no longer remaining only in words but have been seamlessly assimilated with other aspects of governance. Research and writing are key passions for me, because this is also how we can drive a positive change when it comes to improving the lives of persons with disabilities. Here too, working towards empowering women with disabilities has been very important for me. I conduct extensive training workshops for government and educational institutions to further this goal. I have worked widely in making schools accessible in India. This is vital because, no one must be denied education just because of lack of accessible infrastructure. Recognising the importance of basic needs, I’ve worked on WASH facilities for persons with disabilities and conducted anthropometric studies to better understand the needs of mobility aid users. Our collective success in Swachh Bharat has particularly benefited persons with disabilities. Ultimately, I aim to be a leading force in creating accessible and inclusive environments in India, with a deep commitment to empowering individuals with disabilities in partnership with individuals, organisations and governments. The mindset change, combined with positive action on the ground and many policy changes have been encouraging. Today, many women with disabi",
      "likes": 352097,
      "timestamp": "2025-03-08T07:41:17.000Z",
      "extractedAt": "2025-05-27T18:45:53.704Z"
    },
    {
      "url": "https://www.instagram.com/narendramodi/p/DG7SE0yzhCC/?img_index=1",
      "username": "",
      "postText": "A financially empowered woman is a confident decision-maker, independent thinker, architect of her own future and a maker of modern India! And, our nation is taking the lead in building financially empowered women.I, @ajaita , am really delighted to be handling PM @narendramodi Ji’s social media handles on #WomensDay. I am the Founder and CEO of Frontier Markets.One issue that remained close to my heart was the challenges women face in rural areas. These challenges could be financial, access to infrastructure and more. Thus, I have spent the last two decades to mitigate this. And, I feel proud that not only have I been able to make a difference, I am also seeing many more women rising to the occasion and doing the same.In 2011, I founded Frontier Markets with a simple belief that if we support our rural women, no force will stop them from achieving the impossible. Our combined efforts have ensured a powerful network of thousands of women who are becoming self-reliant and giving livelihoods to other women.It is gladdening that over the last few years, there are very meaningful conversations happening on this subject. With things like bank coverage, social security, access to better healthcare and improved sanitation, women are finding it much easier to pursue their dreams and create value for society.Our emphasis has always been on integrating technology to ensure skilling and financial inclusion of women. It would amaze you all, the ease with which India’s women are adapting to technology. Our ‘Meri Saheli App’ is a small contribution to harnessing tech and AI to help rural women become entrepreneurs. It has also enabled the world to see the strengths of our women in diverse areas like agriculture, healthcare, consumer durables and financial literacy.Today, our nation can’t be ignored by the world. We are a promising market with an innovative spirit. And, this journey will get even stronger with women’s participation. I will urge all women to become a part of the India Story. A lot of women have shown how to break barriers and achieve this. My own experience says that the sky is the limit. Be self-reliant and give a better life to the future gene",
      "likes": 787745,
      "timestamp": "2025-03-08T05:16:12.000Z",
      "extractedAt": "2025-05-27T18:46:05.238Z"
    }
  ],
  "scrapedAt": "2025-05-27T18:46:07.990Z"
}