{
  "username": "nasa",
  "totalPosts": 30,
  "posts": [
    {
      "url": "https://www.instagram.com/nasa/p/DI_5kePycFe/",
      "username": "",
      "postText": "You are getting sleepy, very sleepy… 😵‍💫⁣⁣This mesmerizing view of concentric light circles is a star trail: a photograph that shows stars’ apparent motion over time in the night sky. NASA astronaut Don Pettit made this composite image combining 18 30-second-long exposures (that is, he left the camera shutter open for half a minute for each photo) taken while aboard the @ISS in 2012.⁣⁣The space station travels at a speed of five miles per second (8 km per s), orbiting Earth about every 90 minutes. In 24 hours, the crew aboard see 16 sunrises and sunsets. The orbital lab’s unique viewpoint and speed make it perfect for observations of Earth, allowing astronauts to take photos of our home planet, its atmosphere, and natural disasters.⁣⁣Image description: In this composite photo made of long exposures, stars make concentric circles of blue and white light in space. Below, Earth is blue with lines of yellow light streaking across it. Earth’s atmosphere is orange here, with a thin green border. Also visible at top is part of the Japanese Experiment Module Exposed Facility.⁣⁣Credit: NASA/Don Pettit⁣⁣#NASA #Stars #Space #Light #LongExposure #Photography",
      "likes": 195282,
      "timestamp": "2025-04-28T17:21:13.000Z",
      "extractedAt": "2025-05-27T20:19:49.707Z"
    },
    {
      "url": "https://www.instagram.com/nasa/p/DI4cwICyjvc/",
      "username": "",
      "postText": "Big crater, small rover 🌔Actually, the Lunar Roving Vehicle was 10 feet (3.0 m) long and 7.5 feet (2.3 m) wide — roughly the size of a small car — but in this photo, it's dwarfed by Plum Crater, which is nearly 130 feet (40 m) in diameter. Apollo 16 astronauts John W. Young and Charles M. Duke drove the lunar rover to Plum Crater on April 21, 1972, to collect samples; this photo of Duke was taken by Young, the mission commander. \"Big Muley,\" a 26-pound (11.7-kg) rock collected by Young and Duke on the rim of Plum Crater, was the largest single sample brought back from the Moon during the entire Apollo program. Today, we're preparing for #Artemis II, which will send humans around the Moon in 2026 for the first time in over 50 years. Follow @NASAArtemis for the latest mission updates!Image description: A deep lunar crater stretches off the left edge of this photo; its very bottom is shrouded in shadow. On the far side of the crater, the white, boxy Lunar Roving Vehicle can be faintly seen, with a bright lens flare above and to the right. An astronaut in their spacesuit is standing on the right side of this photo, facing the camera, with an L-shaped lunar sampling tool in their left hand.Credit: NASA/John W. Young#NASA #Space #Moon #Apollo #Apollo16 #NASAHistory #LunarRover",
      "likes": 496935,
      "timestamp": "2025-04-25T19:54:39.000Z",
      "extractedAt": "2025-05-27T20:20:00.116Z"
    },
    {
      "url": "https://www.instagram.com/nasa/p/DHmJzmbJpi8/",
      "username": "",
      "postText": "A cosmic cherry on top 🍒⁣⁣@NASAWebb treated us to a sweet perspective: Herbig-Haro 49/50—a towering swirl from a nearby protostar—is (coincidentally) topped with a multi-hued spiral galaxy.⁣⁣Herbig-Haro objects are outflows produced by jets launched from a nearby, forming star. The outflows, which can extend for light-years, plow into a denser region of material. This creates shock waves, heating the material to higher temperatures. The material then cools by emitting light at visible and infrared wavelengths.⁣⁣The galaxy that appears, by chance, at the tip of this cosmic soft-serve is a much more distant, face-on spiral galaxy. It has a prominent central bulge represented in blue, filled with older stars. The bulge also shows hints of “side lobes,” suggesting that this could be a barred spiral galaxy. Reddish clumps within the spiral arms show the locations of warm dust and groups of forming stars.⁣⁣Image description: This cosmic image is dominated with billowing clouds of orange-red gas, rich in detail. At the tip of the cloud, a spiral galaxy is visible, with a concentrated blue center that fades outwards to blend in with red spiral arms. The black background is speckled with some white stars and some smaller, fainter, and more detailed galaxies in shades of white and blue.⁣⁣Credit: NASA, ESA, CSA, STScI⁣⁣#NASA #Space #Telescope #JWST #Webb",
      "likes": 718255,
      "timestamp": "2025-03-24T20:51:17.000Z",
      "extractedAt": "2025-05-27T20:20:09.154Z"
    },
    {
      "url": "https://www.instagram.com/nasa/p/DKHqUAQNVWU/",
      "username": "",
      "postText": "On #MemorialDay, we remember and honor those who gave the last full measure of devotion in service to our country. Ad astra per aspera.Image description: A large American flag floats in the cupola of the International Space Station. The slightly rumpled flag, which takes up most of the photo's lower half, arcs across the cupola, roughly following its hexagonal walls. Above the flag, several of the cupola's windows look out onto Earth, where blue seas and white clouds fill the view.Credit: NASA/Scott Kelly#NASA #Space #SpaceStation #AdAstra",
      "likes": 221953,
      "timestamp": "2025-05-26T14:13:08.000Z",
      "extractedAt": "2025-05-27T20:20:17.985Z"
    },
    {
      "url": "https://www.instagram.com/nasa/p/DJ-BTIjJp6y/",
      "username": "",
      "postText": "Look into the eye 🌀   @NASAHubble captures a fierce ring of stars in a spiral galaxy located 50 million light-years from Earth. The bright blue ring visible in this image hosts blazing young stars.   Can you spot two other space objects in this image? The bright point ringed with a crisscross pattern is a star from our own galaxy surrounded by diffraction spikes, while the redder elongated smudge nearby is a distant galaxy lying far beyond the one pictured here.   The data used in this image is from hundreds of observations between Hubble and the ALMA array in the Atacama Desert. The combination of observations helps astronomers chart the connections between vast clouds of cold gas and the fiercely hot, young stars that form within them.   Image description: A vast, face-on spiral galaxy that holds an inner ring of bright blue, young stars. Stars dot the distance in shades of blue and red.   Credit:  ESA/Hubble & NASA, J. Lee and the PHANGS-HST Team   #NASA #Space #Hubble #Telescope #Universe #Stars #Astronomy #Galaxy",
      "likes": 321914,
      "timestamp": "2025-05-22T20:21:30.000Z",
      "extractedAt": "2025-05-27T20:20:27.646Z"
    },
    {
      "url": "https://www.instagram.com/nasa/p/DJ7Gw5eTuWN/",
      "username": "",
      "postText": "That's no moon. Oh wait. Yes it is.This is a photo of Mars, taken before dawn by our Perseverance rover, and that tiny dot in the sky is Deimos, the smaller of Mars' two moons. Deimos is much, *much* smaller than Earth's Moon: it's about 9 by 7 by 6.8 miles (15x12x11 km) in size. Because it's so tiny, its gravitational forces make it more of a lump than a sphere.Because it was taken at night with a long exposure time, this image of the Martian night sky is a little more grainy than other photos we've received from our Perseverance and Curiosity rovers. Would the night sky on Mars be filled with twinkling stars like we’re used to seeing on Earth? Get the full story from @NASAJPL in an Instagram Reel they published on April 15, 2025.Image description: A gray, dimly-lit Martian landscape. Gentle red hilltops in the distance help separate the surface from the sky, in which a dim white light shines just right of center.Credit: NASA/JPL-Caltech#NASA #Space #Mars #MarsRover #PerseveranceRover #FactCheck",
      "likes": 421157,
      "timestamp": "2025-05-21T17:11:40.000Z",
      "extractedAt": "2025-05-27T20:20:38.274Z"
    },
    {
      "url": "https://www.instagram.com/nasa/p/DJ4b_lTtVEQ/",
      "username": "",
      "postText": "Saturn’s greatest hits, now on vinyl 🎶⁣⁣Saturn and its innermost rings look like a close-up of a record in this image taken by Cassini, a sophisticated robotic spacecraft sent to study Saturn and its complex system of rings and moons in unprecedented detail. For more than a decade, Cassini shared the wonders of Saturn, its spectacular rings, and its family of icy moons.⁣⁣Saturn's rings are thought to be pieces of comets, asteroids, or shattered moons that broke up before they reached the planet, torn apart by Saturn's powerful gravity. They are made of billions of small chunks of ice and rock coated with other materials such as dust. The ring particles mostly range from tiny, dust-sized icy grains to chunks as big as a house. A few particles are as large as mountains.⁣⁣P.S. This picture doesn’t make any noise, but we have transformed other photos into sound with data sonification. You can listen to some here – and even learn how to make your own! https://go.nasa.gov/SpaceSounds⁣⁣Image description: A close-up black-and-white photo of Saturn’s rings. The rings look like grooves on a record. On the right, the rings cast a dark shadow on Saturn, which appears white here.⁣⁣Credit: NASA/JPL-Caltech/Space Science Institute⁣⁣#NASA #Saturn #Rings #Planet #Space",
      "likes": 198085,
      "timestamp": "2025-05-20T16:19:25.000Z",
      "extractedAt": "2025-05-27T20:20:47.643Z"
    },
    {
      "url": "https://www.instagram.com/nasa/p/DJ13nJ6NF5C/",
      "username": "",
      "postText": "Hotter than the bluest flame 🔥  Our friends at the @EuropeanSpaceAgency recently shared a dazzling young star cluster as astronomers have never seen it before.   This star cluster, NGC 346, is located in the Small Magellanic Cloud, a satellite galaxy of the Milky Way about 200,000 light-years away. Though @NASAHubble has studied this cluster before, this image is the first to combine Hubble’s observations made at infrared, optical, and ultraviolet wavelengths, giving an intricate view into the star-forming factory.   NGC 346 is home to more than 2,500 newborn stars. The cluster’s most massive stars, which are many times more massive than our Sun, blaze with intense blue light in this image. Researchers used two sets of observations taken 11 years apart to trace the motions of NGC 346’s stars, revealing them to be spiraling in toward the center of the cluster. This spiraling motion arises from a stream of gas from outside of the cluster that fuels star formation in the center of the turbulent cloud.  Image description: A star cluster within a nebula. Thin, pale-blue wisps of clouds fill the background while denser areas of pinkish clouds appear superimposed upon them. The star cluster holds bright-blue stars that illuminate the nebula. Large arcs of dense, reddish-brown dust pressed together by the stars’ radiation curve around, in front of, and behind the clustered stars. Many orange stars are visible in the background behind the clouds of the nebula.  Credit: ESA/Hubble & NASA, A. Nota, P. Massey, E. Sabbi, C. Murray, M. Zamani (ESA/Hubble)  #NASA #Space #Hubble #Telescope #Astronomy #Stars #Cosmos #Universe",
      "likes": 387646,
      "timestamp": "2025-05-19T16:22:56.000Z",
      "extractedAt": "2025-05-27T20:20:57.362Z"
    },
    {
      "url": "https://www.instagram.com/nasa/p/DJuVfuGz_TV/",
      "username": "",
      "postText": "Viewing Earth from the best seat in the house 🧑🏻‍🚀A starry night sky and an atmospheric glow blanket Earth's horizon in this image taken from the International Space Station (@ISS) as it orbited 257 miles (about 413 km) above Southeast Asia on Feb. 20, 2025.The station’s orbital path takes it over 90 percent of the Earth’s population, with astronauts taking millions of images of the planet below. Check out more facts about the space station:- The International Space Station is larger than a six-bedroom house, with six sleeping quarters, two bathrooms, a gym, and a 360-degree-view window called the cupola.- The space station has been continuously occupied since November 2000.- Peggy Whitson holds the record among American astronauts for the most time spent in space, at 675 days.- The station travels a distance equivalent to the Moon and back in about a day.Image description: A picture of Southeast Asia taken from the International Space Station. Stars shine above Earth as its horizon glows in yellow. Extending from the bottom left, Singapore and Kuala Lumpur light up the coast of the Malay Peninsula in white and green. At the center, fishing boats and their lights dot the Gulf of Thailand and South China Sea.Credit: NASA/Don Pettit#NASA #Space #ISS #SpaceStation #NightSky #Singapore #Earth #Asia #Photography #Astronaut",
      "likes": 298185,
      "timestamp": "2025-05-16T18:10:15.000Z",
      "extractedAt": "2025-05-27T20:21:06.811Z"
    },
    {
      "url": "https://www.instagram.com/nasa/p/DJrhETOJoVS/",
      "username": "",
      "postText": "Spring cleaning for a cosmic spiderweb 🧹The Tarantula Nebula, located in a neighboring galaxy about 160,000 light-years from Earth, is full of bright clouds of gas and dark clumps of dust. This nebula is one of the most productive star-forming regions in the nearby universe—and even though its individual dust grains are incredibly tiny, far smaller than the width of a single human hair, gravity brings them together in disks around these stars to form larger clumps. Eventually, these clumps can form planets and solar systems, clearing out the space around them. This image of the Tarantula Nebula was captured by our orbiting @NASAHubble telescope.Image description: A dazzling cosmic landscape is filled with white, red, and brown strands. Dark, fine clumps of dust draw a line from the top-center to center-right. Stars in shades of purple and blue fill the background.Credit: ESA/Hubble & NASA, C. Murray#NASA #Space #Universe #Nebula #Astrophotography",
      "likes": 377141,
      "timestamp": "2025-05-15T15:53:32.000Z",
      "extractedAt": "2025-05-27T20:21:16.170Z"
    },
    {
      "url": "https://www.instagram.com/nasa/p/DJo1scjuEhs/",
      "username": "",
      "postText": "Sweet dreams come after hours 😴⁣ ⁣@astro_ayers snapped this nighttime photo of Seoul, South Korea on April 25, 2025, as the @ISS orbited 259 miles (417 km) above.⁣ ⁣The International Space Station circles the Earth every 90 minutes, traveling at about 17,500 miles (28,000 km) per hour. This gives the crew 16 sunrises and sunsets every day! All of these passes give the station crew a unique opportunity to observe our home planet. Crew members – and external station cameras – take pictures of the Earth at all hours of the day, capturing our planet’s beauty and nature’s devastation.⁣ ⁣Image description: Seoul’s city lights shine into the darkness. The lights are brightest nearer to the Han River, which splits the city.⁣ ⁣Credit: NASA/Nichole Ayers⁣ ⁣#NASA #SpaceStation #ISS #SouthKorea #Seoul #NightPhotography #BTS",
      "likes": 314996,
      "timestamp": "2025-05-14T14:56:11.000Z",
      "extractedAt": "2025-05-27T20:21:27.291Z"
    },
    {
      "url": "https://www.instagram.com/nasa/p/DJmdOE1t7Qq/",
      "username": "",
      "postText": "Sometimes, it takes three 🧑‍🚀🧑‍🚀🧑‍🚀On May 13, 1992—33 years ago today—astronauts Richard J. Hieb, Thomas D. Akers and Pierre J. Thuot stepped outside of space shuttle Endeavour on the first (and so far, only) three-person spacewalk. The trio spent eight-and-a-half hours maneuvering the Intelsat VI satellite seen here into the shuttle's cargo bay, where a new motor was installed to help it reach its final orbit.STS-49, the mission on which this spacewalk took place, was Endeavour's inaugural flight into space. Endeavour flew 25 missions, spending 299 days and over 120 million miles (190 million km) in low Earth orbit, before touching down at @NASAKennedy for the last time in 2011. Nine years later, Robert Behnken and Douglas Hurley, the first astronauts to visit the @ISS in SpaceX's Crew Dragon, named their spacecraft \"Endeavour\" in honor of the first shuttle they ever flew on.Image description: A massive black, cylindrical satellite hovers in orbit over the complex machinery of space shuttle Endeavour. Three astronauts in spacesuits, spaced evenly around it, are holding on to its bottom and its attached hardware. The cloudy Earth fills the background. Credit: NASA#NASA #Endeavour #SpaceShuttle #NASAHistory #OnThisDay",
      "likes": 169042,
      "timestamp": "2025-05-13T16:43:48.000Z",
      "extractedAt": "2025-05-27T20:21:36.681Z"
    },
    {
      "url": "https://www.instagram.com/nasa/p/DJjYPnntBmg/?img_index=1",
      "username": "nasa",
      "postText": "More passion, more energy 🕺 The amazing dancing lights we can see close to the North and South Poles of Earth happen on other planets, too, and @NASAWebb captured new details of auroras on the biggest planet in our solar system. Observations show that auroras on Jupiter are huge in size and are also hundreds of times more energetic than auroras on Earth. On Earth, auroras are caused by solar storms. When charged particles rain down on the upper atmosphere, it excites gases and causes them to glow colors of red, green, and purple. On Jupiter, there's an additional source of auroras — the magnetic field of the gas giant grabs charged particles from its surroundings, including its tumultuous volcanic moon, Io.Io’s estimated 400 volcanoes spew particles that escape the moon’s gravity and orbit Jupiter. During a solar storm, a barrage of charged particles is unleashed onto the planet. Jupiter’s large and powerful magnetic field captures charged particles and accelerates them to tremendous speeds. These speedy particles slam into the planet’s atmosphere at high energies, which excites the gas and causes it to glow. Now, Webb’s unique capabilities are providing new insights into the auroras on Jupiter. The telescope’s sensitivity allows astronomers to increase the shutter speed to capture the quick changes of auroral features. Visual descriptions:1. The planet Jupiter as seen in near-infrared light. Its clouds are dark blue and white in color, with some red spots within the clouds, while its poles are tinged with green, yellow, and red. A box over the North Pole is overlaid with more data in shades of orange, displaying auroras as arcs and rings. 2. The inset area is shown in larger detail. This video is a close-up near-infrared look at Jupiter’s North Pole, in shades of orange. Swirling auroras cover the pole. Credit: ESA/Webb, NASA, CSA, J. Nichols (University of Leicester), M. Zamani (ESA/Webb) #NASA #Space #JWST #NASAWebb #Telescope #Jupiter #SolarSystem #Aurora",
      "likes": 355842,
      "timestamp": "2025-05-12T12:17:40.000Z",
      "extractedAt": "2025-05-27T20:21:47.139Z"
    },
    {
      "url": "https://www.instagram.com/nasa/p/DJcZmXnT5L9/",
      "username": "",
      "postText": "Star power 🌟 The Carina Nebula complex is one of the most energetic star-forming areas in our galaxy — within it lies the Keyhole Nebula, pictured here by the European Southern Observatory. Our Stratospheric Observatory for Infrared Astronomy (SOFIA) was able to detect the magnetic field streamlines shown over this image. Eta Carinae, a huge active star neighboring the Keyhole Nebula, could have influenced the nebula's shape with its strong winds. Data from SOFIA's observations show that the magnetic fields in the loop seem affected by the star's strong wing. The magnetic field spreads out in a fan shape, matching the wind from Eta Carinae. This shows that the magnetic field is being disturbed by the star's energy. The magnetic field in the loop is much weaker than the star's wind, which means that while magnetic fields are important in the early stages of star formation, they don’t do much to stop the cloud from being broken apart by the energy from massive stars. Scientists now wonder if the same is true in other places where big stars are forming. Image description: The Keyhole Nebula glows in shades of blue, pink and purple. In the center of the nebula, the magnetic fields are identified by what resembles a wind pattern, moving in swirls around a loop in the center. Stars dot the background of the image in shades of pink and blue. Credit: NASA, the SOFIA science team, Y. Seo; ESO #NASA #Space #Stars #Astronomy #Keyhole #Nebula #MagneticFields",
      "likes": 486637,
      "timestamp": "2025-05-09T18:59:48.000Z",
      "extractedAt": "2025-05-27T20:21:56.213Z"
    },
    {
      "url": "https://www.instagram.com/nasa/p/DJZ7JSXpjhi/",
      "username": "",
      "postText": "Peeking inside the Mystic Mountain ⛰️In a nebula filled with newborn stars, 7,500 light-years from Earth, lies the Mystic Mountain: a massive pillar of gas and dust. The three-light-year-tall Mystic Mountain gets its name from its towering, craggy landscape, which resembles a mountain to the naked eye. However, @NASAHubble's near-infrared vision is able to peer through the gas and dust, keeping a ghostly outline while allowing astronomers to see the stars within.Hubble captured this image of the Mystic Mountain in 2010 as it celebrated 20 years in orbit. More recently, the Carina Nebula (the home of the Mystic Mountain) was the subject of one of the first full-color science images ever captured by @NASAWebb.Image description: A mountain-like cloud, in shades of pink and black, reaches up through the center of this image. Inside and surrounding it, countless orange-red stars (with four-point diffraction spikes) of various sizes fill the rest of the image.Credit: NASA, ESA, Hubble 20th Anniversary Team, Mario Livio (STScI)#NASA #Space #Universe #Astrophotography #Hubble",
      "likes": 319940,
      "timestamp": "2025-05-08T19:55:10.000Z",
      "extractedAt": "2025-05-27T20:22:04.838Z"
    },
    {
      "url": "https://www.instagram.com/nasa/p/DJWznQEtuEr/",
      "username": "",
      "postText": "Off-balance, on full display 💫   A spiral galaxy at a skewed angle dazzles in this @NASAHubble image. But this is not your common spiral galaxy — this galaxy was cataloged as one of 338 odd galaxies in the Atlas of Peculiar Galaxies compiled by astronomer Halton Arp in 1966. Many of the galaxies are in the process of interacting with other galaxies, while others are dwarf galaxies without well-defined structures.   What made this galaxy earn its spot in the catalog? Its single broad, star-speckled spiral arm that appears to stretch toward us. The galaxy’s far side sports a few wisps of gas and stars, but it lacks a similarly impressive spiral arm.   Image description: A spiral galaxy seen at a skewed angle. Its center is a bright spot radiating light. A thick, stormy disk of material surrounds this bright center, with swirling strands of dark dust and bright spots of star formation strewn through the disk. A large spiral arm extends from the disk toward the viewer. Some foreground stars are visible atop the galaxy.   Credit: ESA/Hubble & NASA, J. Dalcanton, R. J. Foley (UC Santa Cruz), C. Kilpatrick   #NASA #Space #Stars #Astronomy #Galaxy #Hubble #Telescope",
      "likes": 305116,
      "timestamp": "2025-05-07T14:51:32.000Z",
      "extractedAt": "2025-05-27T20:22:15.010Z"
    },
    {
      "url": "https://www.instagram.com/nasa/p/DJUPcx_t6rz/",
      "username": "",
      "postText": "These violent delights have violet ends 💀💜⁣⁣Data from @NASAChandraXray and @NASAHubble come together in this image to highlight the beautiful but violent events occurring at the center of a violet-colored galaxy 230 million light-years away.⁣ ⁣The telescopes’ team-up reveals the presence of a supermassive black hole and the jets it generates. Gas swirling near the black hole results in bubbles of material blowing into the galaxy cluster, and long gaseous filaments stretch out beyond the galaxy into the X-ray-emitting gas that fills the cluster.⁣ ⁣Composite photos like these provide important clues about how black holes affect their surrounding environment. The X-ray data from Chandra contribute to the soft purple shells around the outside of the center. Dust lanes, star-forming regions, hydrogen filaments, foreground stars, and background galaxies are contributions from the Hubble optical data. Fun fact: those hydrogen filaments are the only visible-light evidence of the relationship between the central black hole and the surrounding gas.⁣ ⁣This galaxy is at the center of the Perseus Cluster, a massive cluster of galaxies immersed in an enormous cloud of gas so hot it only glows in X-rays. The Perseus galaxy cluster is 11 million light-years across and is named for its host constellation.⁣ ⁣Image description: A galaxy with a white center surrounded by pink lobes above and below it. Outside the pink lobes is a violet shell that surrounds the galaxy. From the center of the galaxy are stringy filaments of red gas. Further out, bright stars are sprinkled around the edges of the image.⁣ ⁣Credit: Image: NASA, ESA, and L. Frattare (STScI); Science: X-ray: NASA/CXC/IoA/A.Fabian et al.; Radio: NRAO/VLA/G. Taylor; Optical: NASA, ESA, the Hubble Heritage (STScI/AURA)-ESA/Hubble Collaboration, and A. Fabian (Institute of Astronomy, University of Cambridge, UK)⁣ ⁣#NASA #Hubble #Chandra #Telescope #Observatory #BlackHole #Galaxy",
      "likes": 264848,
      "timestamp": "2025-05-06T14:57:11.000Z",
      "extractedAt": "2025-05-27T20:22:25.796Z"
    },
    {
      "url": "https://www.instagram.com/nasa/p/DJRsFM7NzmK/?img_index=1",
      "username": "",
      "postText": "“I don’t know why I go to extremes.” —Jupiter (probably)   The planet is home to fierce jet streams, polar cyclones bigger than Australia, the most powerful aurora and harshest radiation belts in the solar system - and we’re just scratching the surface.    Data from Juno helped develop a new model to better understand the fast-moving jet stream that encircles Jupiter’s cyclone-festooned north pole. Juno took the first-ever temperature measurement of the cap of Jupiter’s atmosphere above the north pole: it’s about 52ºF (11ºC) cooler than its surroundings and is encircled by winds exceeding 100 mph (161 kph). Unlike hurricanes on Earth, which typically occur in isolation and at lower latitudes, Jupiter’s massive northern polar cyclone and the eight cyclones that encircle it are confined to the polar region. Jupiter’s cyclones cluster together while approaching the pole, and their motion slows as they begin interacting with neighboring cyclones.   Image description: An enhanced-color image split into two frames shows Jupiter’s northern high latitudes from an altitude of about 36,000 miles (58,000 km) above the giant planet’s cloud tops during the spacecrafts 69th flyby on Jan. 28, 2025. Jupiter’s hemisphere spans the two images and shows swirling storms in shades of blues, grays and browns that cross the planet in diagonal bands.   Credit: NASA/JPL-Caltech/SwRI/MSSS Image processing: Jackie Branc (CC BY)   #NASA #Space #Jupiter #SolarSystem #Planet #Juno #Spacecraft",
      "likes": 390845,
      "timestamp": "2025-05-05T15:09:31.000Z",
      "extractedAt": "2025-05-27T20:22:35.497Z"
    },
    {
      "url": "https://www.instagram.com/nasa/p/DJKA-LPOxQP/",
      "username": "",
      "postText": "Don't let anyone treat you like a yellow starburst. You're a pink starburst. 💖What you're seeing here is a starburst in a distant galaxy. The Cigar Galaxy, located 12 million light-years from Earth, gets its name from its thin, cigar-like appearance. The Cigar Galaxy is actually a spiral galaxy, like our own Milky Way—we're just seeing it on its side. Gravitational forces from its galactic neighbor (known as M81, or Messier 81) are resonating through the Cigar Galaxy, causing stars to form at an extraordinarily high rate. Eventually, though, the Cigar Galaxy will burn itself out: when it runs out of new material to make stars, likely in tens of millions of years, the starburst will subside.This image of the Cigar Galaxy was unveiled by our @NASAHubble telescope team in 2006. The red in the image represents hydrogen and infrared light, indicating starburst activity. The blue and greenish-yellow colors are visible wavelengths of light. Image description: A ghostly, bluish-yellow oval is intersected by a wispy hourglass-shaped cloud of red. Stars and galaxies of various colors and sizes light up the dark background.Credit: NASA, ESA, and the Hubble Heritage Team (STScI/AURA). Acknowledgment: J. Gallagher (University of Wisconsin), M. Mountain (STScI), and P. Puxley (NSF)#NASA #Space #Universe #Galaxy #Hubble #Astrophotography #Starburst",
      "likes": 337795,
      "timestamp": "2025-05-02T15:38:08.000Z",
      "extractedAt": "2025-05-27T20:22:44.101Z"
    },
    {
      "url": "https://www.instagram.com/nasa/reel/DJH_zF6ou0e/",
      "username": "",
      "postText": "It's gonna be May 💥 We have a new month of skywatching ahead of us! On May 6, catch the peak of the Eta Aquarid meteor shower early this morning, or spy a few shooting stars two or three nights before the peak event. Check out a few of our neighboring planets all month long:Venus: Appears bright and low in the east in the hour before sunrise.Mars: Easy to find in the west in the first few hours of the night.Jupiter: Shines brightly in the west all monthSaturn: Begins the month next to Venus, low in the eastern sky before sunrise. Quickly separates from Saturn and rises higher in the sky each day before dawn. Credit: NASA/JPL-CaltechThumbnail credit: Bill Dunford #NASA #Space #WhatsUp #ThingsToDo #Tips #SkyWatching #StarGazing #NightSky #May #Astronomy",
      "likes": 95096,
      "timestamp": "2025-05-01T20:51:01.000Z",
      "extractedAt": "2025-05-27T20:22:56.286Z"
    },
    {
      "url": "https://www.instagram.com/nasa/p/DJE8lK7v7fB/",
      "username": "",
      "postText": "Add a pop of color! 🎨⁣ ⁣When the cameras on NASA’s New Horizons spacecraft first spotted the large reddish polar region on Pluto’s largest moon, Charon, mission scientists knew two things: they’d never seen anything like it elsewhere in our solar system, and they couldn’t wait to get the story behind it.⁣ ⁣Turns out Pluto is something of a graffiti artist – methane gas escapes from Pluto’s atmosphere, becomes “trapped” by Charon’s gravity, and freezes to the cold, icy surface at the moon’s pole. When it’s springtime on Charon, the returning sunlight triggers the frozen methane to change back into gas, which leaves behind heavier chemical compounds. Sunlight further irradiates those leftovers into reddish material that has slowly accumulated on Charon’s poles over millions of years.⁣ ⁣The image combines blue, red, and infrared images taken by New Horizons’ Ralph/Multispectral Visual Imaging Camera (MVIC); the colors are processed to best highlight the variation of surface properties across Charon. New Horizons was the first spacecraft to explore Pluto up close. In early 2019, New Horizons flew past its second major science target – Arrokoth, the most distant object ever explored up close.⁣Image description: Pluto’s largest moon, Charon, is gray with a jagged line of fractures and canyons going across it diagonally. There are many craters visible, especially on the bottom and right sides. At the top, in a region informally named Mordor Macula, Charon is a deep, rusty red.⁣ ⁣Credit: NASA/JHUAPL/SwRI⁣ ⁣#NASA #Pluto #Moon #Astronomy #Science",
      "likes": 343128,
      "timestamp": "2025-04-30T16:23:40.000Z",
      "extractedAt": "2025-05-27T20:23:05.859Z"
    },
    {
      "url": "https://www.instagram.com/nasa/p/DJCJvyQttr5/?img_index=1",
      "username": "",
      "postText": "Swan dive into this starfield 🦢  Messier 17, also known as the Omega Nebula or Swan Nebula, is one of the largest star-forming regions in the Milky Way galaxy. In this image by @NASAHubble, the central portion of the nebula has been colorized to highlight certain wavelengths of light. Green represents oxygen, while red reveals hydrogen and infrared light.   The Swan Nebula is located 5,500 light-years away from Earth in the constellation Sagittarius and is home to one of our galaxy’s youngest star clusters. The young stars in this cluster are difficult to see because of the gas and dust that surrounds them. The powerful radiation from the young stars evaporates and erodes the dense clouds of cold gas in which new stars form.   Image description: Blue and orange stars glitter across the image, interwoven with dark clouds of brown dust and bright, glowing regions of blue.  Credit: NASA, ESA, and A. Kraus (The University of Texas at Austin); Processing: Gladys Kober (NASA/Catholic University of America)  #NASA #Space #Hubble #Telescope #Swan #Nebula #Stars #Blue #Astronomy",
      "likes": 473574,
      "timestamp": "2025-04-29T14:20:53.000Z",
      "extractedAt": "2025-05-27T20:23:16.763Z"
    },
    {
      "url": "https://www.instagram.com/nasa/p/DI1WsiZJ5J6/",
      "username": "nasa",
      "postText": "Hooked on the cosmos 😍 The Cygnus Loop (also known as the Veil Nebula) is a supernova remnant, left over from a massive stellar explosion that occurred 5,000 to 8,000 years ago. The original supernova would have been bright enough to be seen clearly from Earth with the naked eye. At three degrees across, the Cygnus Loop is as wide as six full moons in the night sky.This image is a combination of X-ray data from NASA's Chandra X-ray Observatory and optical data by amateur astronomer John Stone — but the @NASAChandraXray team has also just released a new 3D visualization of the Cygnus Loop. It visualizes how the blast wave from the explosion interacts with an isolated cloud of the interstellar medium (that is, dust and gas in between the stars). You can view that 3D model and others like it at nasa.gov/chandra.Image description: In the composite image, the remnant resembles a wispy cloud in oranges, blues, purples, and whites, shaped like a backwards letter C. The remnant is set against a backdrop of scattered stars.Credit: X-ray: NASA/SAO/CXC; Optical: John Stone (Astrobin); Image Processing: NASA/SAO/CXC/L. Frattare, N. Wolk#NASA #Space #Chandra #Telescope #Universe #Supernova",
      "likes": 561198,
      "timestamp": "2025-04-24T15:03:55.000Z",
      "extractedAt": "2025-05-27T20:23:24.898Z"
    },
    {
      "url": "https://www.instagram.com/nasa/p/DIysfGNpBa2/?img_index=1",
      "username": "nasa",
      "postText": "One telescope. Nearly 1.7 million observations. Thirty-five years – and counting.  In celebration of the Hubble Space Telescope’s April 24 launch anniversary, we’re sharing new images from the famous observatory.  From within our home solar system, to stunning nebulae found in interstellar space, to a far-flung galaxy, these anniversary images are a reminder of Hubble’s impact on every area of astronomy.  Since its launch in 1990, the Hubble mission has fundamentally changed the way we understand our universe. Its impactful discoveries and iconic images make it a scientific and cultural icon.  Hubble’s powerful and unique vision – spanning ultraviolet, visible, and near-infrared wavelengths – continues to unlock cosmic mysteries. In fact, its astronomical achievements have resulted in over 22,000 scientific papers and over 1.3 million citations as of February 2025.  At 35 years old, Hubble remains a scientific powerhouse. Here’s to more discovery ahead!  You can find out more about these anniversary images at the link in @NASAHubble’s bio. Find image descriptions and photo credits in the comments.  #NASA #ESA #Hubble35 #Hubble #Space #Science #Astronomy #Stars",
      "likes": 499929,
      "timestamp": "2025-04-23T14:16:36.000Z",
      "extractedAt": "2025-05-27T20:23:39.407Z"
    },
    {
      "url": "https://www.instagram.com/nasa/reel/DIwMYbtOuxM/",
      "username": "nasa",
      "postText": "Our muse, Earth 🌎  We study our home planet like no one else. For more than 60 years, we’ve been observing Earth from land, air, and space, building our scientific capabilities to better understand the Earth system and how it works.  @NASAEarth science missions help us respond to challenges—such as fires, hurricanes, and water shortages—by putting actionable data in the hands of decisionmakers. NASA satellites, airborne projects, and  programs help local, federal, and international governments as they support their communities.  Exploring the significance of our home empowers our journey to the cosmos and beyond.   Credit: NASA/Shane Apple  #NASA #Space #EarthDay2025 #EarthDay #POV #Science #Missions #Journeys",
      "likes": 88913,
      "timestamp": "2025-04-22T14:58:58.000Z",
      "extractedAt": "2025-05-27T20:23:48.585Z"
    },
    {
      "url": "https://www.instagram.com/nasa/p/DImPMf_pBs_/?img_index=1",
      "username": "nasa",
      "postText": "He came. He saw. He took really great pictures.This weekend, Don Pettit will return to Earth after his 7-month mission to the International Space Station (@ISS). Throughout his stay, @astro_pettit contributed to research that benefits humanity and supports future space missions.Pettit also shared what he calls his “”science of opportunity”” to demonstrate how experimenting with our surroundings can help gain a better understanding of how things work. This understanding is enhanced when art, science, and microgravity come together. Check out a few of Don’s many photos.Image descriptions: 1. Comet C2024-G3 soars through space as pictured from the ISS. The lower half of the photo glows blue from Earth’s atmosphere; the top half contrasts with the blackness of space. 2. A long-exposure photo of Earth taken from the ISS. The city lights create streaks of color in shades of white, blue and green. In the distance, the horizon glows red. The long-exposure format captures the stars in the distance above Earth. At the top of the photo are segments of the ISS and a portion of its solar arrays.3. A time-lapse image of an aurora dancing over Earth. The aurora glows in shades of green and diffuses in the atmosphere in red hues. City lights shine through the aurora in white. 4. A photo of a starfield taken from the ISS. Earth’s surface is seen in the bottom left corner of the image. The atmosphere glows in a bright orange above it. In the distance, Eta Carinae is pictured in the center of the image in hues of blue. 5. Sunlight glints off a river that flows in a zig-zag shape across Earth’s surface. Clouds swirl over the right side of the image. 6. NASA astronaut Don Pettit takes a break and poses for a portrait aboard the Destiny laboratory module.Credit: NASA/Don Pettit#NASA #Space #Astrophotography #Photography #Astronauts #ISS #SpaceStation",
      "likes": 522951,
      "timestamp": "2025-04-18T18:33:21.000Z",
      "extractedAt": "2025-05-27T20:23:57.995Z"
    },
    {
      "url": "https://www.instagram.com/nasa/p/DIjbVirv6PV/",
      "username": "",
      "postText": "That’s one speedy spud 🥔⁣⁣@NASAHubble took 13 separate exposures over 22 minutes to create this time-lapse image of tiny, potato-shaped moon Phobos (at left) orbiting around Mars. Phobos is so small that it looks like a star in these Hubble photos.⁣⁣This little tater is fast, though: Phobos orbits Mars in just 7 hours and 39 minutes, which is faster than Mars rotates. The moon’s orbit is very slowly shrinking, meaning it will eventually – as in, 50 million years from now – break up under Mars’ gravitational pull, or crash onto the planet.⁣⁣Poor little Phobos has already been battered: it was nearly shattered by a giant impact, and has gouges from thousands of meteorite impacts.⁣⁣Here are a few more fun facts about Phobos:⁣- It has no atmosphere.⁣- It’s the larger of Mars’ two moons. The other moon is called Deimos.⁣- The fine dust on Phobos’ surface cannot retain heat.⁣⁣Image description: Tiny moon Phobos travels behind Mars in this image. The moon appears multiple times, since this is a time-lapse photo. Phobos is a small silvery dot here. Mars dominates the photos. Mars is mostly red-orange, with dark blotches and silvery wisps all around its edges.⁣⁣Credit: NASA, ESA, and Z. Levay (STScI)⁣⁣#NASA #Mars #Moon #Phobos #Astronomy #Potato",
      "likes": 306256,
      "timestamp": "2025-04-17T15:58:16.000Z",
      "extractedAt": "2025-05-27T20:24:07.350Z"
    },
    {
      "url": "https://www.instagram.com/nasa/p/DIg-fXWtV7v/",
      "username": "",
      "postText": "Can we get an encore?A planetary nebula located just 4,600 light-years away in the Milky Way galaxy puts on a spectacular display at the end of a giant star's life. The image itself was the final work of one of @NASAHubble's instruments: the Wide Field and Planetary Camera 2 (WFPC2). First installed in 1993, the WFPC2 was replaced in 2009 by the Wide Field Camera 3 during Hubble’s final servicing mission.The swirling, paint-like clouds in the darkness of space are clouds of ionized atoms thrown into space by a dying star. Its red giant star had exhausted its available fuel and shed its last layers of gas, enabling nuclear fusion as its compact core begins to contract further. The exposed core reaches extremely hot temperatures, radiating ultraviolet light that energizes the enormous clouds of gas cast off by the star. In this image, red and orange indicate nitrogen, green is hydrogen, and blue shows oxygen. The spectacle is bittersweet, as the brief phase of fusion in the core will end after only tens of thousands of years, leaving a white dwarf that will never illuminate the clouds around it again.Image description: A glowing, jagged ring encircles a small central region of greenish clouds, making it appear like a hole torn in fabric. This “hole” is itself encircled by a band of silvery-blue clouds and a larger, fainter, yellow ring of gas. Puffy, smoky clouds of orange and red gas billow out from there into a large oval nebula, fading into the dark background of space dotted by stars.Credit: @EuropeanSpaceAgency/Hubble & NASA, K. Noll#NASA #Space #Hubble #MilkyWay #Stars #Nebula #Encore #Telescope",
      "likes": 356936,
      "timestamp": "2025-04-16T17:10:13.000Z",
      "extractedAt": "2025-05-27T20:24:16.456Z"
    },
    {
      "url": "https://www.instagram.com/nasa/p/DIerBbsJ4ZC/",
      "username": "nasa",
      "postText": "Livin' life in low Earth orbit For nearly 25 years, @NASAAstronauts have been living and working aboard the International Space Station. Some have only stayed for a few days, while some have lived in space for over a year at a time. (Astronaut Frank Rubio holds the NASA record, with a 371-day stay.) Some have traveled to the @ISS several times, while some are making their first visit—like NASA's Nichole Ayers, seen here opening the hatch to the station's Kibo laboratory. Ayers launched to the station on NASA's SpaceX Crew-10 mission, which lifted off from @NASAKennedy on March 14.The International Space Station is an orbiting laboratory, built to help us learn how to live in space while making life better back on Earth. We work with crew members and researchers from around the world to study human health, medicine and biology, materials research, Earth science and countless other scientific disciplines. (Visit nasa.gov/iss-research for more info.) Now, we're working with commercial partners on a new generation of space stations, making space more accessible and affordable as we send humans to the Moon and Mars.Image description: Astronaut Nichole Ayers floats above a large, circular hatch in the International Space Station. She is looking down at the hatch and wearing a crimson long-sleeved shirt; her blond hair floats above her head. The hatch is hinged open to reveal the circular doorway into the station's Kibo laboratory; behind her, the walls of the station are mostly white panels, with a few cords and pieces of hardware.Credit: NASA#NASA #Space #Aerospace #Universe #Astronaut #SpaceStation #ISS",
      "likes": 234495,
      "timestamp": "2025-04-15T19:39:00.000Z",
      "extractedAt": "2025-05-27T20:24:24.209Z"
    },
    {
      "url": "https://www.instagram.com/nasa/p/DIb_DP9zmHn/",
      "username": "",
      "postText": "Take life at your own pace🐢⁣⁣Let this tortoise photographed making its way across a @NASAKennedy parking area be your reminder to take things slow. It’s just one of the many kinds of animals – more than 65 amphibian and reptile, 25 mammal, 117 fish, and 330 bird species – that call the Merritt Island National Wildlife Refuge home. The refuge shares space with Kennedy.⁣⁣In the background of this photo is the iconic Vehicle Assembly Building (VAB), standing 525 feet (160 meters) tall. This is where the @NASAArtemis launch vehicles are stacked and processed in preparation for future missions to the Moon. Currently, the Artemis II Moon rocket is taking shape inside the VAB.⁣⁣Image description: A brown tortoise lifts its front right leg as it walks across gravel, far in front of a large rectangular building. Scales on the tortoise’s legs and sand on its shell are visible. There are a few streets separating the tortoise from the building, which has a massive United States flag and NASA “meatball” logo painted on it, as well as a sign that reads “Launch America.”⁣⁣Credit: NASA/Ben Smegelsky⁣⁣#NASA #Wildlife #Tortoise #SlowAndSteady #Nature #Animals",
      "likes": 643433,
      "timestamp": "2025-04-14T18:36:24.000Z",
      "extractedAt": "2025-05-27T20:24:32.965Z"
    }
  ],
  "scrapedAt": "2025-05-27T20:24:36.342Z"
}