{
  "username": "natgeo",
  "totalPosts": 30,
  "posts": [
    {
      "url": "https://www.instagram.com/natgeo/p/DKKv8-PzFaG/",
      "username": "natgeo",
      "postText": "Colorectal cancer rates in young people under 54 have risen by 11 percent in the last 20 years. But what's behind this alarming trend? A new study reveals a surprising potential link—colibactin, a toxin produced by E. coli and other bacteria that can damage DNA. Could this finding change the future of colon cancer prevention and earlier detection?Learn more about how colibactin can go rogue and other new research into early colon cancer at the link in bio.Micrograph by Steve Gschmeissner, Science Photo Library",
      "likes": 29200,
      "timestamp": "2025-05-27T19:00:10.000Z",
      "extractedAt": "2025-05-27T20:25:06.400Z"
    },
    {
      "url": "https://www.instagram.com/vancityreynolds/p/DKKPeG8tE1o/",
      "username": "vancityreynolds",
      "postText": "Kingdom. Phylum. Classless. #Underdogs premieres June 15 at 9/8c on @natgeotv, simulcast on @abc. Streaming next day on @DisneyPlus and @hulu",
      "likes": 16413,
      "timestamp": "2025-05-27T14:16:13.000Z",
      "extractedAt": "2025-05-27T20:25:16.096Z"
    },
    {
      "url": "https://www.instagram.com/natgeo/reel/DKKGw2LPMVN/",
      "username": "natgeo",
      "postText": "After over 135 years of bringing you the top of the food chain, we figured it's time to show some love to the bottom.#Underdogs, narrated by @vancityreynolds, premieres Sunday, June 15 at 9/8c on @natgeotv, simulcast on @abc. Streaming next day on @DisneyPlus and @hulu.",
      "likes": 26631,
      "timestamp": "2025-05-27T13:00:38.000Z",
      "extractedAt": "2025-05-27T20:25:26.823Z"
    },
    {
      "url": "https://www.instagram.com/natgeo/reel/DKJzA_nACOl/",
      "username": "natgeo",
      "postText": "Spring in Patagonia is a time of abundance, and this puma mother and her cubs are taking full advantage of it. Preparing her cubs for life in this harsh landscape isn't easy, but this mother—filmed by Martin Gregus, Jr. @mywildlive—is giving her cubs all of her love and attention while she teaches them what they need to know to survive.",
      "likes": 51416,
      "timestamp": "2025-05-27T10:07:48.000Z",
      "extractedAt": "2025-05-27T20:25:36.485Z"
    },
    {
      "url": "https://www.instagram.com/natgeo/p/DKIfwQaN8Gk/",
      "username": "natgeo",
      "postText": "Are you a responsible oldest child, an overlooked middle, or a free-spirited youngest sibling?For those who adhere to the theory that birth order influences personality, the answer to that question could hold the key to who you are as a person. The psychological debate about sibling order has persisted for decades—and recent studies may have an answer. Learn what the research actually says about birth order at the link in bio.Photograph by Hans Neleman, Getty Images",
      "likes": 26929,
      "timestamp": "2025-05-26T22:00:08.000Z",
      "extractedAt": "2025-05-27T20:25:46.138Z"
    },
    {
      "url": "https://www.instagram.com/natgeo/reel/DKIR2A9gWd6/",
      "username": "natgeo",
      "postText": "Humans aren't the only ones who can keep a beat. Drumming is a fairly common behavior in nature, with animals like gorillas, caterpillars, and palm cockatoos using percussion to make themselves heard.Host: @nicholas_garbaty",
      "likes": 17245,
      "timestamp": "2025-05-26T19:59:33.000Z",
      "extractedAt": "2025-05-27T20:25:54.076Z"
    },
    {
      "url": "https://www.instagram.com/natgeodocs/reel/DKH2o0uRheI/",
      "username": "natgeodocs",
      "postText": "A little weightlessness can bring a lot of joy. Happy birthday to the indomitable and inspiring Sally Ride, the first American woman in space. #SALLYfilm premieres June 16 at 9/8c on National Geographic. Streaming next day on @DisneyPlus and @hulu",
      "likes": 7561,
      "timestamp": "2025-05-26T16:00:00.000Z",
      "extractedAt": "2025-05-27T20:26:05.699Z"
    },
    {
      "url": "https://www.instagram.com/natgeo/p/DKHh-DXtdTz/?img_index=1",
      "username": "natgeo",
      "postText": "Have you ever wondered why some animals \"glow\" in the dark? From opossums and flying squirrels to hawksbill sea turtles, many creatures have ultraviolet color patterns that are invisible to the human eye. This is a phenomenon known as photoluminescence—and it's more common in nature than you might think. But what's the purpose of this hidden glow? Learn more about what scientists are uncovering at the link in bio.Photos by Nebraska Wildlife Rehab/Alex Wiles and David Guttenfelder (@dguttenfelder)",
      "likes": 143239,
      "timestamp": "2025-05-26T13:00:12.000Z",
      "extractedAt": "2025-05-27T20:26:13.735Z"
    },
    {
      "url": "https://www.instagram.com/natgeo/p/DKF69gmthMg/",
      "username": "natgeo",
      "postText": "Think your legs do all the work in a marathon? Think again. 🧠 A new study reveals that during extreme endurance events, the brain burns its own fat—specifically myelin, the fatty insulation around nerve fibers—to keep functioning. But why does this happen and is there danger in overdoing it? Run, don't walk, to the link in bio to find out more about what running does to the brain. Photograph by Ben Stansall, AFP/Getty Images",
      "likes": 55737,
      "timestamp": "2025-05-25T22:00:09.000Z",
      "extractedAt": "2025-05-27T20:26:23.706Z"
    },
    {
      "url": "https://www.instagram.com/natgeo/p/DKFmXSQTOk1/",
      "username": "natgeo",
      "postText": "High above Chile, clear skies and a bright blue lake offer a picture-perfect glimpse of Patagonian beauty.Photograph by Eric Firnhaber",
      "likes": 65065,
      "timestamp": "2025-05-25T19:00:10.000Z",
      "extractedAt": "2025-05-27T20:26:32.776Z"
    },
    {
      "url": "https://www.instagram.com/natgeohistory/p/DKFRwv2tPGV/",
      "username": "natgeohistory",
      "postText": "Archaeologists excavating the ruins of the Maya city of Tikal in Guatemala have unearthed a 1,600-year-old altar likely used for human sacrifices, surrounded by the bones of children. With grave goods, murals, and burial styles traced directly to Teotihuacan, the grim discovery adds weight to the idea that Tikal was ruled at this time by overlords from the non-Maya city of Teotihuacan, more than 600 miles away in what’s now Mexico. The find challenges the idea that Teotihuacan’s influence at Tikal was gentle and mainly through trade. Head to the link in bio for the full story. Photograph by Edwin Román Ramírez",
      "likes": 32046,
      "timestamp": "2025-05-25T16:00:09.000Z",
      "extractedAt": "2025-05-27T20:26:43.750Z"
    },
    {
      "url": "https://www.instagram.com/natgeo/p/DKE-iP9tyN1/?img_index=1",
      "username": "natgeo",
      "postText": "Zombie fungi are known for their gruesome method of infecting insects and turning them into spore-spreading vessels for Ophiocordyceps. But what if we could repurpose their unique characteristics? For example, some mycologists believe these parasitic fungi could help farmers kill pests like mealybugs and aphids, allowing crops to grow healthier.Discover more about the surprising uses of zombie fungi at the link in bio.",
      "likes": 280875,
      "timestamp": "2025-05-25T13:12:11.000Z",
      "extractedAt": "2025-05-27T20:26:52.766Z"
    },
    {
      "url": "https://www.instagram.com/natgeo/p/DKDqxLZNtSZ/",
      "username": "natgeo",
      "postText": "Photo by @joelsartore | The Visayan leopard cat is one of several leopard cat subspecies known to science. A solitary species, these small cats mark their home ranges by scratching trees or using scent marks. The size of an individual’s territory depends on the available habitat and the level of resource competition in the area. This photo was taken at the Avilon Zoo, in the Philippines. To see more species featured in the Photo Ark, follow me, @joelsartore. #PhotoArk",
      "likes": 73121,
      "timestamp": "2025-05-25T01:00:11.000Z",
      "extractedAt": "2025-05-27T20:27:01.485Z"
    },
    {
      "url": "https://www.instagram.com/natgeo/p/DKDBkOMzT6-/",
      "username": "natgeo",
      "postText": "Is your mess stressing you out? Or do you thrive in chaos?Everyone these days seems to have an opinion on how your space can best support your mental health, but what’s the real science?Head to the link in bio to learn more about how organizing your environment can boost your mood and productivity, and expert tips on how to get started.Photograph by Laurie Rubin, Getty Images",
      "likes": 34353,
      "timestamp": "2025-05-24T19:00:13.000Z",
      "extractedAt": "2025-05-27T20:27:10.589Z"
    },
    {
      "url": "https://www.instagram.com/natgeo/reel/DKCsen6gzCD/",
      "error": "Navigation timeout of 30000 ms exceeded",
      "extractedAt": "2025-05-27T20:27:44.071Z"
    },
    {
      "url": "https://www.instagram.com/natgeo/p/DKCYYJuNJlu/?img_index=1",
      "username": "natgeo",
      "postText": "In a dramatic reproductive spectacle, large numbers of opalescent squids swarm the shallows off California to spawn. During this ritual, females lay capsules filled with up to 300 eggs before dying—alongside the males—leaving their offspring unprotected on the seafloor. Enter the Capitella ovincola. These marine worm \"midwives\" burrow into the capsules—not to harm, but to help. Find out how at the link in bio. Photographs by @julesjacobs_photo",
      "likes": 81608,
      "timestamp": "2025-05-24T13:00:10.000Z",
      "extractedAt": "2025-05-27T20:27:53.612Z"
    },
    {
      "url": "https://www.instagram.com/natgeo/p/DKBF-aGvXlB/",
      "username": "natgeo",
      "postText": "Green sea turtles are usually found in tropical and subtropical coastal waters, but they're living in our hearts this World Turtle Day! 💛Photograph by @enricsala",
      "likes": 82385,
      "timestamp": "2025-05-24T01:00:12.000Z",
      "extractedAt": "2025-05-27T20:28:03.523Z"
    },
    {
      "url": "https://www.instagram.com/natgeoanimals/reel/DKAqg-FSKSm/",
      "username": "natgeoanimals",
      "postText": "In need of relaxation? Take your cues from Popi 😌#SecretsOfThePenguins is now streaming on @DisneyPlus and @hulu.",
      "likes": 75870,
      "timestamp": "2025-05-23T21:00:24.000Z",
      "extractedAt": "2025-05-27T20:28:15.662Z"
    },
    {
      "url": "https://www.instagram.com/natgeotv/reel/DKAILwnoeMQ/",
      "username": "natgeotv",
      "postText": "This is your sign to treat yourself to pizza for lunch today 🍕Watch #TucciInItaly, Sundays at 8/7c on National Geographic. Now streaming on @DisneyPlus and @hulu.",
      "likes": 37738,
      "timestamp": "2025-05-23T16:00:43.000Z",
      "extractedAt": "2025-05-27T20:28:40.612Z"
    },
    {
      "url": "https://www.instagram.com/natgeoanimals/reel/DJ_6c4wM4P2/",
      "username": "natgeoanimals",
      "postText": "If anyone's earned their main character status, it's Douglas.",
      "likes": 33568,
      "timestamp": "2025-05-23T14:00:33.000Z",
      "extractedAt": "2025-05-27T20:28:49.530Z"
    },
    {
      "url": "https://www.instagram.com/natgeo/p/DJ_e_k1vr_R/?img_index=1",
      "username": "natgeo",
      "postText": "Romans, Saxons, Normans—People have inhabited the banks of the River Thames for thousands of years, making its foreshore the longest archaeological site in London. It's a beacon for amateur treasure hunters—called mudlarks—who regularly search the Thames' riverbank for recently unearthed artifacts. The river's silt blocks oxygen from reaching buried treasures, preventing metal from rusting, while the tides expose new artifacts daily. But a recent surge in popularity—thanks to viral influencers—has forced the Port of London Authority to cap the number of permits it offers mudlarks, impacting both the hobbyists and the treasures they seek.Pictured above are some of the treasures discovered in the River Thames: 18th-century dentures made from human teeth, a Roman marble head (probably of a goddess), a ball and chain from the late 1600s, and glasses from around 1600 CE.Learn more about mudlarking and see what these enthusiasts have unearthed at the link in bio.Photographs by @simoncroberts",
      "likes": 41653,
      "timestamp": "2025-05-23T10:00:17.000Z",
      "extractedAt": "2025-05-27T20:28:59.708Z"
    },
    {
      "url": "https://www.instagram.com/natgeo/reel/DJ9-9gaR-KU/",
      "username": "natgeo",
      "postText": "#AD  Follow National Geographic photographer Jonathan Irish as he explores Tokyo’s famed Tsukiji Outer Market, capturing the vibrant energy, handcrafted treasures, and rich culinary culture unfolding around every corner. See more of Jonathan’s trip and photos at the link in bio. | The Citi® / AAdvantage® Platinum Select® card earns you AAdvantage® miles toward your next trip & Loyalty Points toward AAdvantage® status on all your purchases. Learn about a special bonus offer at citi.com/adventure @citibank @americanair",
      "likes": 8776,
      "timestamp": "2025-05-22T20:01:38.000Z",
      "extractedAt": "2025-05-27T20:29:10.802Z"
    },
    {
      "url": "https://www.instagram.com/natgeo/p/DJ7nyF5Phjn/",
      "username": "natgeo",
      "postText": "Photo by Muhammed Muheisen @mmuheisen | A few years ago I captured this image of the moon as it rose above the ancient Temple of Poseidon in Cape Sounion, Greece. The temple was built in the fifth century B.C. It was dedicated to the god of the sea and served as a landmark for sailors. For more photos and videos from different parts of the world, follow me @mmuheisen.",
      "likes": 239006,
      "timestamp": "2025-05-21T22:00:10.000Z",
      "extractedAt": "2025-05-27T20:29:20.022Z"
    },
    {
      "url": "https://www.instagram.com/natgeo/p/DJ6-lRqzE_9/",
      "username": "natgeo",
      "postText": "If you're a coffee drinker, it may be time to switch over... 🍵Second only to water in global popularity, tea is celebrated for its calming effect—but it's also packed with antioxidants and compounds that boost your health, focus, and longevity.Learn more about the science behind this ancient beverage and its health benefits at the link in bio. #InternationalTeaDayPhotograph by @alextreadway",
      "likes": 51024,
      "timestamp": "2025-05-21T16:00:14.000Z",
      "extractedAt": "2025-05-27T20:29:28.695Z"
    },
    {
      "url": "https://www.instagram.com/natgeo/reel/DJ6qAEgKqT_/",
      "username": "natgeo",
      "postText": "The Battle of Kadesh stands as the largest chariot battle ever recorded in history, with over 5,000 chariots thundering across the battlefield in a clash so monumental it was literally carved into stone. On one side, the Egyptian army led by Ramses II; on the other, the Hittite Empire—but who won? Learn more about the Hittites at the link in bio.Host: Amy Briggs",
      "likes": 22616,
      "timestamp": "2025-05-21T13:01:05.000Z",
      "extractedAt": "2025-05-27T20:29:39.540Z"
    },
    {
      "url": "https://www.instagram.com/natgeo/p/DJ4uZWnulNv/",
      "username": "natgeo",
      "postText": "Due to the recessive nature of the “redhead gene,” it’s become a popular belief that the ginger friends we have today could be among the last, with some even claiming that they’re on the verge of extinction. But science says those claims are a serious stretch. While flaming locks aren't destined to die out anytime soon, their origin and genetic rarity are fascinating.Head to the link in bio to learn more about the history and science of redheads.Photograph by @kikeo",
      "likes": 67175,
      "timestamp": "2025-05-20T19:00:14.000Z",
      "extractedAt": "2025-05-27T20:29:49.249Z"
    },
    {
      "url": "https://www.instagram.com/natgeo/p/DJ4ZzePT6jQ/?img_index=1",
      "username": "natgeo",
      "postText": "Comprised of over 500,000 images, this new digital scan of the Titanic is so precise, it can even pick out small personal objects left behind by the passengers.#TitanicTheDigitalResurrection is now streaming on @DisneyPlus and @hulu.",
      "likes": 815260,
      "timestamp": "2025-05-20T16:00:15.000Z",
      "extractedAt": "2025-05-27T20:29:57.944Z"
    },
    {
      "url": "https://www.instagram.com/natgeo/reel/DJ4FfBhgjku/",
      "username": "natgeo",
      "postText": "Wishing you a rex-cellent International Dinosaur Day! Did you know the Tyrannosaurus rex was likely born with feathers? 🪶 Learn more about this iconic dinosaur at the link in bio.",
      "likes": 30661,
      "timestamp": "2025-05-20T13:03:06.000Z",
      "extractedAt": "2025-05-27T20:30:07.775Z"
    },
    {
      "url": "https://www.instagram.com/natgeo/p/DJ33eBYzOIs/?img_index=1",
      "username": "natgeo",
      "postText": "Photos by @ingoarndtphotographyHoneybees are now beginning to swarm. Once they leave a hive, they search for a cavity where they can establish a new colony. An old, rotted-out woodpecker nest is a perfect place. From their new home, they begin searching for nectar and pollen to feed themselves and their brood. Photo 1: The swarm moves into an old black woodpecker nest cavity (viewed from inside to outside). Photo 2: A construction bee uses its mandibles to take wax scales from a nestmate. Photo 3: About two weeks after the bees move in, the first combs become visible.Honeybees are important pollinators, helping a large variety of plants reproduce and improving harvests., Fruit and vegetable plants in particular depend on honeybee pollination. Some pesticides used in agriculture can be highly toxic to honeybees. Neurotoxins from the neonicotinoid group are particularly devastating. Theys disrupt the bees' sense of orientation and memory and weaken their immune systems. As a result, bees can no longer find their way back to their hive and become vulnerable to disease. #WorldBeeDayThe pictures are part of my story, \"The Secrets of Bees,\" published in the March 2020 issue of National Geographic magazine. You can read it at the link in bio.",
      "likes": 142272,
      "timestamp": "2025-05-20T11:00:14.000Z",
      "extractedAt": "2025-05-27T20:30:15.814Z"
    },
    {
      "url": "https://www.instagram.com/natgeo/p/DJ2wF4vPdUK/?img_index=1",
      "username": "natgeo",
      "postText": "Howler monkey babies have an unusual—and accidental—predator: capuchin monkeys. In Panama, scientists have spotted the primates kidnapping howler infants and inadvertently killing them. But what is causing this behavior? Find out more at the link in bio.Camera trap videos by Brendan Barrett & Christian Ziegler / Max Planck Institute of Animal Behavior",
      "likes": 147761,
      "timestamp": "2025-05-20T00:36:37.000Z",
      "extractedAt": "2025-05-27T20:30:24.065Z"
    }
  ],
  "scrapedAt": "2025-05-27T20:30:26.809Z"
}