{
  "username": "physicsfun",
  "totalPosts": 30,
  "posts": [
    {
      "url": "https://www.instagram.com/physicsfun/reel/DKKsFr2p8-K/",
      "username": "",
      "postText": "Boiler Pen: a miniature “hand boiler” is built into the top of a pen in this odd vintage item in my collection. The boiling point of dichloromethane is slightly below body temperature such that heat from from a finger and thumb will increase pressure in the bottom bulb which then pushes the purple (dyed) liquid through the thin glass pipe to the top. Heating the top bulb will hasten the return of the liquid to the bottom. Such glass devices demonstrate a reversible liquid-gas phase transition and were made famous by Benjamin Franklin, who was one of the first to describe the physics of their operation. Hence these are sometimes referred to as a “Bouillant de Franklin”. ➡️ Follow the link in my profile for info on where to get similar glass boilers and other amazing items featured here on @physicsfun #thermodynamics #phase #physics #physicstoy #phasetransition #physicsfun #phasechange #heat #handboiler #dichloromethane #idealgas #PV=nRT #science #scienceisawesome",
      "likes": 341,
      "timestamp": "2025-05-27T18:27:26.000Z",
      "extractedAt": "2025-05-27T19:54:04.259Z"
    },
    {
      "url": "https://www.instagram.com/physicsfun/reel/DKIIvoMJwUW/",
      "username": "",
      "postText": "Fluorescence of Hokkaidoite: under UV light this root beer tinted translucent rock bursts into bands of intense color from fluorescent inclusions within an opal matrix. This recently discovered natural mineral has a variety of colors under UV unlike anything I’ve ever seen. The fluorescing chemical compounds are thought to be PAHs such as anthanthrene but this new mineral’s properties are still under study. Found only in the Hokkaidō Prefecture of Japan, this sample was collected near Shikaribetsu Lake. ➡️ Follow the link in my profile for info on how to get a quality UV flashlight, fluorescent mineral samples, and other amazing items featured here on @physicsfun #physics #physicsfun #physicstoy #electromagnetism #ultraviolet #uv #fluorescentminerals #longwaveUV #mineralfluorescence #hokkaidoite #calcite #phosphorescent #fluorescent #science #scienceisawesome",
      "likes": 1300,
      "timestamp": "2025-05-26T18:41:49.000Z",
      "extractedAt": "2025-05-27T19:54:13.093Z"
    },
    {
      "url": "https://www.instagram.com/physicsfun/reel/DKFbVDupsAD/",
      "username": "",
      "postText": "Cat Automaton: this feline’s gaze is transfixed upon the black orb- use the end of the lever to move the ball, and the cat’s spherical head will precisely track it. A simple but elegant linkage mechanism with five pivot axes allows the curious behavior. This minimalist wooden creature is perhaps the cutest kinetic art in my collection! ➡️ Follow the link in my profile where to get this cat automaton and other amazing items featured here on @physicsfun #tracking #physics #automata #kinematicchain #cat #linkages #simplemachines #maker #physicstoy #kineticart #phase #lever #science #scienceisawesome",
      "likes": 2505,
      "timestamp": "2025-05-25T17:24:57.000Z",
      "extractedAt": "2025-05-27T19:54:24.594Z"
    },
    {
      "url": "https://www.instagram.com/physicsfun/reel/DKCzQeUJop3/",
      "username": "",
      "postText": "Optical Glass Cube Light Sculpture: multiple internal reflections create intricate and delicate patterns within this crystal glass cube with beveled prismatic edges and concave lens shaped indentations on three faces. The bottom three faces are coated with special metal oxide layers that create color through the physics of thin film interference. This is the smallest (4.0 cm on edge) cube featured by artist Harold Lustig, famous for his precision optical glass sculptures. ➡️ Follow the link in my profile for info on where to get this art and many other amazing items featured here on @physicsfun #mirror #infinity #reflection #optics #physics #physicstoy #dichoric #fresnel #interference #cube #geometry #thinfilmoptics #infinitymirror #illusion #science #infinity #partialreflection #scienceisawesome",
      "likes": 828,
      "timestamp": "2025-05-24T16:56:10.000Z",
      "extractedAt": "2025-05-27T19:54:33.399Z"
    },
    {
      "url": "https://www.instagram.com/physicsfun/reel/DKARD5hJBbv/",
      "username": "",
      "postText": "Paper Turbine Top: a stream of air will induce rotation as the air flows through the engineered turbine blades of this elegantly simple vintage spin top from The Toycrafter. Action equals reaction in action! ➡️ Follow the link in my profile for info on where to buy similar spin tops and many other amazing items featured here on @physicsfun #spin #rpm #spinningtop #angularmomentum #physics #physicstoy #physicsfun #torque #rotation #rotationalinertia #science #aliasing #wagonwheeleffect #scienceisawesome",
      "likes": 1356,
      "timestamp": "2025-05-23T17:18:52.000Z",
      "extractedAt": "2025-05-27T19:54:45.021Z"
    },
    {
      "url": "https://www.instagram.com/physicsfun/reel/DJ9il6oOpH6/",
      "username": "",
      "postText": "Sandscape Spontaneous Stratification: a striking feature of this sand motion desk toy is the formation of striped layers. Typically pouring stuff together results in further mixing, yet here, when the sand mixture descends through a gap, the resulting pile is ordered into sorted layers. The larger rounded dark grains separate from the smaller sharp-edged white grains forming the layers you see here. The darker grains alone would stack into a steeper pile (larger angle of repose) than the white which would form a less steep pile, but when mixed these modes compete forming alternating layers. ➡ Follow the link in my profile for more info about where to buy this and other amazing items featured here on @physicsfun. #physics #physicsfun #physicstoy #granular #stratification #granularphysics #sandart #spontaneousstratification #angleofrepose #avalanche #kineticart #science #scienceisawesome",
      "likes": 1090,
      "timestamp": "2025-05-22T15:54:19.000Z",
      "extractedAt": "2025-05-27T19:54:55.506Z"
    },
    {
      "url": "https://www.instagram.com/physicsfun/reel/DJ7RL-Lyutd/",
      "username": "",
      "postText": "Rolling Marble Sculpture: marbles perform gymnastics as potential energy of gravity is converted to kinetic energy. An elegantly designed auger conveyor, an Archimedes’ Screw, brings the marbles back to the top (powered by an AA battery and a small motor). Conservation of angular momentum produces a simulation of decaying orbits as the marbles whirl down the the main funnel shaped feature. Made with recycled wood by artist Bogdan Krupa ➡️ Follow the link in my profile for info on where to get similar rolling marble kinetic art and other amazing items featured here on @physicsfun #physics #physicstoy #gravity #gravitywell #physics #physicstoy #gravity #Archimedes #physicsfun #augerconveyer #archimedesscrew #angularmomentum #kinetic #kineticart #kineticenergy #marblerun #maborun #vortex #science #scienceisawesome #rollingmarble",
      "likes": 2152,
      "timestamp": "2025-05-21T18:45:02.000Z",
      "extractedAt": "2025-05-27T19:55:06.342Z"
    },
    {
      "url": "https://www.instagram.com/physicsfun/reel/DJ4eVKXJSl0/",
      "username": "",
      "postText": "The Alchemist: an amazing sculpture in my collection is cast from diamagnetic Bismuth metal and features a neodymium cube magnet that levitates- trapped between the hands of the ancient scholar. Diamagnetic substances only have magnetic fields of their own when placed in an external magnetic field from another source- here the cube shaped magnet supplies the field. Diamagnetic fields are pretty weak though so a cylindrical neodymium magnet hangs above the figure and is adjusted to help lift the cube magnet against gravity. Trapped in equilibrium by these magnetic fields, the slightest air currents can send the cube magnet dancing. Although alchemists never succeeded in transmuting lead to gold, in 1981 physicists used the particle accelerator at Berkeley to shoot Carbon nuclei at thin foils of Bismuth- the resulting collisions did produced a tiny amount of Gold atoms! So modern nuclear physics, applied to the element Bismuth, finally accomplished the aspirations of the alchemists. 🌟Another amazing creation by Ernie McElhannon. ➡️ Follow the link in my profile for info on where to get this sculpture and other amazing items featured here on @physicsfun #diamagnetism #physics #physicstoy #neodymium #physicsfun #magneticfield #magnetism #levitation #maglev #science #bismuth #alchemy #alchemist #LBNL #GlennSeaborg #pyrolyticgraphite #scienceisawesome",
      "likes": 2552,
      "timestamp": "2025-05-20T16:42:37.000Z",
      "extractedAt": "2025-05-27T19:55:17.486Z"
    },
    {
      "url": "https://www.instagram.com/physicsfun/reel/DJ1x6THJUtC/",
      "username": "",
      "postText": "Parabolic Sconce Candle: 29 carefully cut and aligned mirrors set to reflect in parallel what is placed at a centered point. More specifically if the flame of the candle is placed at the focus of the parabola, the light rays from the mirror segments will leave along parallel paths, allowing the candlelight to be projected in a beam. Such candle holders were common before the invention of electric light. ➡️ Follow the link in my profile for info on where to buy many of the amazing items featured here on @physicsfun #physics #physicstoy #physicsfun #amazing #lightrays #mirascope #parabolic #parabola #mirror #optics #parabolicreflector #science #scienceisawesome",
      "likes": 3403,
      "timestamp": "2025-05-19T15:38:37.000Z",
      "extractedAt": "2025-05-27T19:55:28.318Z"
    },
    {
      "url": "https://www.instagram.com/physicsfun/reel/DJwpL1Fppgp/",
      "username": "",
      "postText": "Maxwell’s Dynamical Top: A 1/2 scale precision replica of the famous “Dynamical Top” created and demonstrated by the great physicist James Clerk Maxwell in 1857. The four color disk allowed Maxwell to see and study the direction of the angular momentum vector when a spinning object is subjected to a jolt/impact. After the top gets a flick from my hand note that one can see a circle of evenly changing color- the angular momentum vector points outward through the center of that circle. Balanced such that the spin point was placed at its center of mass, this unique top was used by Maxwell to experimentally test many theories about how the Earth and planets wobble as they spin. Swipe to see another astonishing property of this top described in a previous post. This beautiful historical replica was made by machinist and creator Jim Peever @machinedmarvels- and as far as I know the only other replicas of this device were made in the 1880’s! ➡️ Follow the link in my profile for info on where to get many of the amazing items featured here on @physicsfun #angularmomentum #rotation #torque #vector #vectoraddition #precession #physicsfun #physics #physicstoy #MaxwellsTop #dynamical #spiral #friction #rollingwithoutslipping #spinningtop #science #gyroscope #gyroscopic #scienceisawesome",
      "likes": 2012,
      "timestamp": "2025-05-17T15:42:40.000Z",
      "extractedAt": "2025-05-27T19:55:38.093Z"
    },
    {
      "url": "https://www.instagram.com/physicsfun/reel/DJuZyHNJZxG/",
      "username": "",
      "postText": "Personal Geiger Counter: this affordable detector will sense a wide range of invisible ionizing radiation using a Geiger-Müller tube the size of a ballpoint pen. Here the counter is clearly sensing the radiation from the Thorium 232 found in some (older) lantern mantles. Th232 is a naturally occurring radioactive element which decays to Lead (Pb208) through a complicated decay chain involving gamma, beta, and alpha particle emissions. This device is from Russian old stock surplus and currently sold by vendors in the Ukraine. ➡️ Follow the link in my profile for info and on where to get this device and many more of the amazing items featured here on @physicsfun #trinitite #physicsfun #nuclear physics  #geigercounter #geology #physics #physicstoy #oppenheimer #physicshistory #geophysicstoy #glass #atomic #radiation #radioactivity #science",
      "likes": 1351,
      "timestamp": "2025-05-16T18:49:12.000Z",
      "extractedAt": "2025-05-27T19:55:48.287Z"
    },
    {
      "url": "https://www.instagram.com/physicsfun/reel/DJr4_8qSVFy/",
      "username": "",
      "postText": "Chaotic Double Pendulum with Ring: the intricate dance of chaotic motion from a simple assembly of two physical pendulums (one attached to the end of the other) with the energy of the system moving back and forth between the potential energy of gravity to the kinetic energy of motion. Chaotic motion is characterized by extreme sensitivity to initial starting conditions, tiny differences in how the system is released leads to dramatically different outcomes each time. Another extraordinary design by Kontax Engineering Ltd.➡️ Follow the link in my profile for info on where to get beautiful pendulum kit and other amazing items featured here on @physicsfun #physicstoy #chaos #chaoticmotion #chaostheory #kineticart #pendulum #physicsfun #doublependulum #physicalpendulum #strangeattractor #science #scienceisawesome",
      "likes": 2036,
      "timestamp": "2025-05-15T19:25:33.000Z",
      "extractedAt": "2025-05-27T19:55:57.097Z"
    },
    {
      "url": "https://www.instagram.com/physicsfun/reel/DJpMog7SA5B/",
      "username": "",
      "postText": "Ramp Walker Toy: dragged to the edge but never over. Physics puzzle- why does the toy stop at the edge? (hint below) Patented in 1888, ramp walkers exhibit complex motion with very simple construction. This one features a character from Disney’s Jungle Book circa 1966. ➡️ Follow the link in my profile for info on where to buy ramp walkers and other amazing items featured here on @physicsfun #physicsfun #physicstoy #physics #rampwalker #oldschool #vector #newtonssecondlaw #FequalsMA #toy #classictoy #force #forcevector #science #scienceisawesome ✏️ physics hint: Note that as the toy approaches the edge, the direction of pull becomes straight down.",
      "likes": 4936,
      "timestamp": "2025-05-14T18:22:27.000Z",
      "extractedAt": "2025-05-27T19:56:08.110Z"
    },
    {
      "url": "https://www.instagram.com/physicsfun/reel/DJmh_mSp4tW/",
      "username": "",
      "postText": "Camphor Craft Miniature Self Propelling Toy Sailing Ship: this vintage toy boat is propelled by a difference in surface tension. Fluids will flow away from regions of lower surface tension (Marangoni Effect) and as the camphor mixes with the water at the stern of the boat a gradient of surface tension is created pushing the boat forward. Made in Cornwall England-this 1960’s vintage toy came in its original packaging. ➡️ Follow the link in my profile for more info and where to buy many of the items featured here on @physicsfun #physics #physicsfun #physicstoy #toyboat #camphorboat #marangoni #marangonieffect #surfacetension #masstransfer #CarloMarangoni #tearsofwine #fluiddynamics #science #scienceisawesome",
      "likes": 1451,
      "timestamp": "2025-05-13T17:27:15.000Z",
      "extractedAt": "2025-05-27T19:56:18.295Z"
    },
    {
      "url": "https://www.instagram.com/physicsfun/reel/DJj7mgWP9ug/",
      "username": "",
      "postText": "Electric Discharge Fractal: the delicate branching structure seen here is a Lichtenberg type fractal created by electron current flow. An interesting aspect of this piece is that the acrylic was filled with electrons in two separate regions, resulting in this two layer pattern when the acrylic was discharged to ground with a flash and bang. Electrons typically will not flow through an insulator such as acrylic, but a high velocity beam of them from a linear accelerator (an expensive and complex apparatus) allows the electrons to tunnel deep into the plastic and build up a very large charge slowly. Such a large charge can then create a high enough voltage to create a breakdown arc which is hot enough to leave the fractal pattern. This sculpture comes with an LED base which illuminates the fractal with morphing colors. ➡️ Follow the link in my profile for info on where to get fractal sculptures like this and other amazing items featured here on @physicsfun #Litchenberg #frozenlightning #fractal #electron #linearaccelerator #beamtree #physics #physicstoy #lamp #lavalamp #electromagnetism #science #lightning #highvoltage #scienceisawesome #electricity #arc #electricarc #fractalart #fractalsculpture",
      "likes": 1776,
      "timestamp": "2025-05-12T17:12:24.000Z",
      "extractedAt": "2025-05-27T19:56:29.474Z"
    },
    {
      "url": "https://www.instagram.com/physicsfun/reel/DJhRuaZp7CB/",
      "username": "",
      "postText": "Two Mirror Kaleidoscope: this unassuming stainless steel cylinder holds within one of the most beautiful kaleidoscopic mandalas I’ve seen. The colors seen come from polarizing filters and thin films encased in oil, and the two mirrors are precisely aligned at a 60 degree angle to produce the sixfold symmetry. This kaleidoscope is the work of expert craftsmen and artist Tomoo Hosono, and bares his signature. ➡️ Follow the link in my profile to find where to get kaleidoscopes like this and other amazing items featured here on @physicsfun #Kaleidoscope #kaleidoscopic #physics #reflect #teleidoscope #physicstoy #physicsfun #psychedelic #kineticart #science  #mirror #symmetry #math #mathtoy #mathstoy #geometry  #brewster #Brewstersociety #waveplate #polarizer #scienceisawesome",
      "likes": 1738,
      "timestamp": "2025-05-11T16:29:01.000Z",
      "extractedAt": "2025-05-27T19:56:39.275Z"
    },
    {
      "url": "https://www.instagram.com/physicsfun/reel/DJcGbi4u-OX/",
      "username": "",
      "postText": "Hyperbolic Holes: this awesome kit is again available- fun with conic sections- a straight rod, in this case a pencil, glides through a symmetrical pair of curved holes. The design is based on the hyperboloid, the 3D ruled surface traced by an offset rotating diagonal line. This device is sold as an inexpensive kit to assemble yourself, and includes a motor with geared drive and pre-cut pieces. The pencil is my addition- sharpened to just the right size to clear the curved openings. ➡️ Follow the link in my profile for info on where to buy this and other amazing items featured here on @physicsfun #math #mathtoy #mathstoy #geometry #physics #physicstoy #hyperbola #hyperboloid #physicsfun #ruledsurface #conicsection #science",
      "likes": 1705,
      "timestamp": "2025-05-09T16:13:24.000Z",
      "extractedAt": "2025-05-27T19:56:49.541Z"
    },
    {
      "url": "https://www.instagram.com/physicsfun/reel/DJZ0DBspb6R/",
      "username": "",
      "postText": "Superposition of Spins: an interesting top from Japan that spins around two axes simultaneously. Note the fourfold symmetric pattern made by the graphics- one spin frequency is 4 times faster than the other. 240fps slow motion reveals how the two spins collude to position the heart images. Without slow-mo the rate of rotation is faster than the flicker fusion frequency so that we see four differently colored hearts connected in a circle (looks better in person- the video frame rate somewhat spoils the illusion). ➡ Follow the link in my profile for info on where to get many of the amazing items featured here on @physicsfun #spin #physics #physicstoy #spinningtop #toytop #flickerfusionfrequency #superposition #grandillusionsltd #rotation #rpm #frequency #centerofmass #amazing #science #scienceisawesome",
      "likes": 1402,
      "timestamp": "2025-05-08T18:59:55.000Z",
      "extractedAt": "2025-05-27T19:57:00.903Z"
    },
    {
      "url": "https://www.instagram.com/physicsfun/reel/DJUhvG8Pens/",
      "username": "",
      "postText": "Levitating Cube Tensegrity: connected only by four segments of fishing line! An amazing 3D print creation by @heliox_lab where the beautifully symmetric configuration is stable in all orientations. Another fun take on the tensegrity concept, invented by Kenneth Snelson and made famous by the architect Buckminster Fuller in 1949. ➡️ Follow the link in my profile for more info about this 3D print sculpture- and where to find many other amazing items featured here on @physicsfun #physics #physicsfun #physicstoy #tensionforce #tensegrity #buckminsterfuller #kennethsnelson  #compression #structuralengineering #floatingcompression #science #scienceisawesome",
      "likes": 1933,
      "timestamp": "2025-05-06T17:37:54.000Z",
      "extractedAt": "2025-05-27T19:57:11.327Z"
    },
    {
      "url": "https://www.instagram.com/physicsfun/reel/DJRpssVu7FD/",
      "username": "",
      "postText": "Dancing Ferrofluid: a repost of a favorite piece of interactive kinetic art- with a black magnetic fluid interacting with a variable strength electromagnet (like those found in speakers). A circuit supplies power to the electromagnet in proportion to the sound waves picked up by a microphone, the changing magnetic field- combined with the liquid surface tension of the colloidal ferromagnetic liquid- produces the captivating motion that keeps time with any music played. Featuring “12 String Thing”, composed and performed by my good friend T.D.Clark @tdclark67 ➡️ Follow the link in my @physicsfun profile for info on where to get this device and other amazing ferrofluid displays. #ferrofluid #speaker #interactivelamp #fluiddynamics #magnets #magneticfield #magnetism #colloidal #physics #physicstoy #science #surfacetension #physicsfun #neodymium #guitar #electromagnet #scienceisawesome #electromagnetism",
      "likes": 3217,
      "timestamp": "2025-05-05T14:58:07.000Z",
      "extractedAt": "2025-05-27T19:57:19.801Z"
    },
    {
      "url": "https://www.instagram.com/physicsfun/reel/DJPXlyCJ04e/",
      "username": "",
      "postText": "Death Star Specular Hologram on Vinyl: That’s no moon! The Stars Wars box set features this amazing “scratch hologram” of a rotating Death Star with a 3D appearance that seems to float above the album. This hologram was hand etched on the metal master by artist Tristan Duke of Infinity Light Science. The etched grooves reflect a point source of light as sharp glints and the groves are arranged so that each eye sees a slightly different pattern such that, via stereopsis, the shiny points appear to float above or below the surface. The Tie Fighter is featured on The Force Awakens LP soundtrack. ➡️ Follow the link in my profile for info on where to get this vinyl LP and many of the amazing items featured here on @physicsfun #hologram #holographic #physics #physicstoy #specularhologram #abrasionhologram #scratchhogram #Starwars #anewhope #TristanDuke #vinyl #albumart #stereoscopic #chatoyance #science #scienceisawesome",
      "likes": 23796,
      "timestamp": "2025-05-04T17:34:52.000Z",
      "extractedAt": "2025-05-27T19:57:31.236Z"
    },
    {
      "url": "https://www.instagram.com/physicsfun/reel/DJMtJyypdlw/",
      "username": "",
      "postText": "3D Phonotrope Spinner: slinky on an escalator! When the rate of rotation matches the rate of the smartphone video process (wait for it) 12 animated 3D-printed slinkys “spring” into motion. The 3D printed and precisely placed depictions of the famous toy is specifically designed to interact with the video process, similar to the animation effect of a flip book, but in a repeating cycle like that of the phenakistiscope, the 1833 invention that started moving media animation that lead to the development of movies and video. Another fantastic design by Travis at @apyrodesign ➡️ Follow the link in my profile for information on where to buy this special spinner and other amazing items featured here on @physicsfun #physicstoy #physicsfun #phonotrope #spiders #phenakistiscope #fidgetspinner #strobetop #spinnerfidget #spinningtop #angularmomentum #physics #rpm #aliasing #wagonwheeleffect #science #scienceisawesome",
      "likes": 3099,
      "timestamp": "2025-05-03T16:43:40.000Z",
      "extractedAt": "2025-05-27T19:57:41.305Z"
    },
    {
      "url": "https://www.instagram.com/physicsfun/reel/DJKLQ73pHFZ/",
      "username": "",
      "postText": "Superposition of Spins: a cylinder launched such that it is spinning around two axes simultaneously. Note the threefold symmetric pattern made by the graphics- one spin frequency is 3 times faster than the other, matching the ratio of the diameter to the length. Any small cylinder with the right ratio will exhibit this interesting behavior. This toy was produced in Italy in the 1990s. ➡️ Follow the link in my profile for info on where to get or make many of the amazing items featured here on @physicsfun  #spin #physics #physicstoy #cylinder #superposition #physicsfun #rotation #rpm #frequency #centerofmass #amazing #science",
      "likes": 1292,
      "timestamp": "2025-05-02T17:10:31.000Z",
      "extractedAt": "2025-05-27T19:57:51.541Z"
    },
    {
      "url": "https://www.instagram.com/physicsfun/reel/DJHd3k7JSzJ/",
      "username": "",
      "postText": "Fiber Optic Lamp: another thrift shop find- a vintage and simple fiber optic lamp encased in an atomic era acrylic bubble. The fiber bundle is illuminated by a lamp in the base and powered by 2 C cell batteries- with a  made in Hong Kong label. Physics of internal reflection and refractive index to channel light through a fiber. ➡️ Follow the link in my profile for info on where to buy a vintage fiber optic lamp and other amazing items featured here on @physicsfun #fiberoptic #internalreflection #optics #lightpipe  #physics #physicstoy #throwback #fiberopticflower #vintage #fiberopticlamp #1970s #science #scienceisawesome",
      "likes": 1315,
      "timestamp": "2025-05-01T15:54:02.000Z",
      "extractedAt": "2025-05-27T19:58:02.054Z"
    },
    {
      "url": "https://www.instagram.com/physicsfun/reel/DJFSTeYz5-2/",
      "username": "",
      "postText": "Chatoyancy of a Satin Spar Sphere: the mineral selenite (satin spar) is often found with parallel fibrous crystalline structures that reflect light in luminous bands (chatoyancy) that appear to move as the specimen is rotated. Selenite fibers are also very clear and will act as a natural form of fiber optic transmission- the sphere looks transparent when the camera lens peers down the fiber bundle direction. ➡️ Follow the link in my profile for info on where to get a polished selenite sphere and many other amazing items featured here on @physicsfun #physics #mineral #gemstone #iridescence #refraction  #selenite #chatoyancy #chatoyancyeffect #satinspar #fiberoptic #rockhound #luster #optics #amazing #mineralogy #geology #geophysicstoy #scienceisawesome",
      "likes": 1374,
      "timestamp": "2025-04-30T19:34:22.000Z",
      "extractedAt": "2025-05-27T19:58:13.804Z"
    },
    {
      "url": "https://www.instagram.com/physicsfun/reel/DJCr_CoyND8/",
      "username": "",
      "postText": "Viscous Fluid Kinetic Art: slowly moving fluids flow in four separate rectangular chambers, exhibiting the characteristic petal and finger shapes described by the physics of viscous fluid dynamics. Found this in a thrift shop, origin and date of manufacture unknown. Comment if you’ve seen one of these- I’d love to know its history. 🙏 ➡️ Follow the link in my profile for info on where to buy many of the physics toys featured here are on @physicsfun #kineticart #viscosity #drag #viscous #fluiddynamics #physicsfun #gravity #physics #physicstoy #bubble #buoyancy #Archimedesprinciple #science #art #desktoy #scienceisawesomell",
      "likes": 2398,
      "timestamp": "2025-04-29T19:28:01.000Z",
      "extractedAt": "2025-05-27T19:58:24.443Z"
    },
    {
      "url": "https://www.instagram.com/physicsfun/reel/DI_qdoeuL8e/",
      "username": "",
      "postText": "The Sander Illusion: contrary to our perception the diagonals of the adjacent parallelograms are the same length. Optical illusions like this one are studied by cognitive psychologists and often give insights to processes of vision and the brain. This nice 3D print allows a physical confirmation that the diagonals are indeed identical in length. ➡️ Follow the link in my profile for info about where to get this geometric illusion and other amazing items featured here on @physicsfun #illusion #geometry #physics #ambiguousobject #physicstoy #math #mathtoy #physicsfun #mathstoy #optics #opticalillusion #3dprinting #perspective #science #scienceisawesome",
      "likes": 2941,
      "timestamp": "2025-04-28T15:10:10.000Z",
      "extractedAt": "2025-05-27T19:58:35.832Z"
    },
    {
      "url": "https://www.instagram.com/physicsfun/reel/DI6fpu0pMN_/",
      "username": "",
      "postText": "Bismuth Diamagnetic Levitation: Element 83 (bismuth) is the most diamagnetic of the elements*. Here a small neodymium magnet is made to  float between two 99% pure bismuth 10mm cubes which are held in precise configuration by friction with the parallel walls of the acrylic assembly I made. Diamagnetic substances only have magnetic fields of their own when placed in an external magnetic field from another source- here the tiny cube magnet supplies the field. Diamagnetic fields are pretty weak though so a powerful cylindrical neodymium magnet sits above the cubes and is adjusted to help lift the tiny cube magnet against gravity. *except for a special form of carbon known as pyrolytic graphite. ➡️ Follow the link in my profile for info on where to get these pure bismuth cubes and other amazing items featured here on @physicsfun #diamagnetism #physics #physicsfun #physicstoy #neodymium #magneticfield #magnetism #levitation #maglev #science #bismuth #eclipse #equilibrium #pyrolyticgraphite #scienceisawesome",
      "likes": 2574,
      "timestamp": "2025-04-26T15:01:04.000Z",
      "extractedAt": "2025-05-27T19:58:44.546Z"
    },
    {
      "url": "https://www.instagram.com/physicsfun/reel/DI1cKrcMJL7/",
      "username": "",
      "postText": "Magnaprobe: visualizing the invisible- a small bar magnet on a gimbal mount demonstrates magnetic field direction for points in space around a magnetized object. Red indicates the north pole and blue the south pole of the Magnaprobe dipole- the red end is attracted to any other magnet’s south pole like a 3D compass. Magnetic viewing film reveals a cross section of the magnetic field where colors correspond to intensity, but can’t show the direction of the field like the magnaprobe device can. Together these devices give us insights about the existence of magnetic fields that our five senses cannot detect. ➡️ Follow the link in my profile for info on where to get this and many other items featured here on @physicsfun #magnaprobe #physics #physicstoy #magnets #magneticfield #magneticforce #electromagnetism #neodymium #dipole #science #scienceisawesome",
      "likes": 2799,
      "timestamp": "2025-04-24T15:54:25.000Z",
      "extractedAt": "2025-05-27T19:58:55.682Z"
    },
    {
      "url": "https://www.instagram.com/physicsfun/p/DIy25dovU9S/?img_index=1",
      "username": "",
      "postText": "Extreme Viscosity Sculpture: a heavy ball bearing descends through a very viscous fluid while a bubble of air ascends in this weird and wonderful vintage kinetic art desk toy I found on eBay. It takes almost two full minutes for the ball to move to the bottom and 5 minutes for the air bubble come to rest at the top- shown here at 5X speed. Note the strange phenomena that occurs when the ball bearing passes by the bubble. Swipe to watch at the actual speed. ➡️ Follow the link in my profile for info on where to buy many of the physics toys featured here are on @physicsfun #kineticart #viscosity #drag #viscous #fluiddynamics #physicsfun #gravity #physics #physicstoy #bubble #buoyancy #Archimedesprinciple #science #art #desktoy #scienceisawesomell",
      "likes": 4209,
      "timestamp": "2025-04-23T15:47:35.000Z",
      "extractedAt": "2025-05-27T19:59:06.675Z"
    }
  ],
  "scrapedAt": "2025-05-27T19:59:10.625Z"
}